#version: 0.2
f f
_ r
ff ff
0 x
o v
m ov
[ r
_ [r
a x
_ e
o r
_ 0x
t r
p tr
_ ptr
_ptr _[r
w or
wor d
word _ptr_[r
] ,</w>
ffff ffff
mov _r
+ 0x
_ q
_q word_ptr_[r
_e ax
p +0x
_0x ffffffff
d i
d x
b p
_r 1
a l
_0xffffffff ffff
s i
_r ax
m p
t e
c al
cal l
_ d
b x
_d word_ptr_[r
8 ],</w>
mov _e
0 ,</w>
s p+0x
e a
e _0x
c x
l ea
0 ],</w>
_rax ,</w>
_eax ,</w>
s t
te st
bp -
i p+0x
mov_r di
mov_r ax
1 ,</w>
bp- 0x
c mp
mov _qword_ptr_[r
mov_rax _qword_ptr_[r
lea _r
] _
2 ,</w>
j mp
x or
d ,</w>
j e_0x
call _0xffffffffffff
8 ,</w>
s p
j n
4 ,</w>
s h
bx ,</w>
3 ,</w>
_eax _eax,</w>
p o
po p
bp ,</w>
d d
jmp _0xffffffffffff
dx ,</w>
_r bx,</w>
a dd
p u
pu sh
_[r ip+0x
5 ,</w>
mov _eax
_r bp,</w>
mov _dword_ptr_[r
_ b
ff f
y te
yte _ptr_[r
mov_r 1
_b yte_ptr_[r
8 ]
_0x 1
]_ 0,</w>
m m
mov_r si
e _0xffffffffffff
x mm
call _0xffffffff
jn e_0x
_ 1,</w>
call_0xffffffff fff
mov_e dx
+0x 1
mov_r dx
_r1 2,</w>
_r sp
sp+0x 1
7 ,</w>
_ xmm
9 ,</w>
e ,</w>
mov_e si
6 ,</w>
0 ]
b ,</w>
_e cx
ip+0x 2
test _eax_eax,</w>
u b
s ub
_r di
c ,</w>
jmp_0xffffffffffff f
f ,</w>
si ,</w>
xor _eax_eax,</w>
a ,</w>
_r dx,</w>
_0x 4
mov_eax _dword_ptr_[r
mov_rax_qword_ptr_[r bp-0x
mov_e di
4 ],</w>
_0x 2
_e dx
mov_rdi _qword_ptr_[r
_r1 3,</w>
+ 8],</w>
z x
mov zx
2 8],</w>
_e dx,</w>
lea_r si
_r cx
r e
+ r
jn e_0xffffffffffff
mov_rdx _qword_ptr_[r
mov_r cx
1 2
ax +0x
mov_e cx
_r1 4,</w>
call _0x
_r1 2
_rdi ,</w>
jmp_0xffffffffffff ff
_e di
c ],</w>
je_0x 1
mov_qword_ptr_[r sp+0x
_ al
mov_rdi _rax,</w>
call_0xffffffffffff f
8 d
n d
1 ],</w>
ax ],</w>
lea_rsi _[rip+0x
1 5
lea_r di
bx +0x
1 3
_r1 5,</w>
8] _rax,</w>
lea_r dx
2 0],</w>
_r si,</w>
_r dx
_ 8,</w>
0 0
_rax _rax,</w>
mov_rsi _qword_ptr_[r
mov_r bx
_r1 3
j e_0xffffffffffff
1 4
test _rax_rax,</w>
_ecx ,</w>
_rcx ,</w>
lea _rax
sub _rsp
mov s
mov_qword_ptr_[r bp-0x
pop _rbx,</w>
a nd
add _rsp
t ,</w>
re t,</w>
_r1 4
mov_r bp
mov_r1 2
mov _byte_ptr_[r
pop _rbp,</w>
mov_rdi _rbx,</w>
_e si
8 ]_0,</w>
_e si,</w>
mov_rcx _qword_ptr_[r
jne_0xffffffffffff ff
push _rbp,</w>
b p+0x
_0x 3
movzx _eax
cmp _eax
9 d
_[r sp+0x
_r1 5
mov_rdi _rbp,</w>
3 0],</w>
movs x
call_0xfffffffffff e
]_ 1,</w>
mov_edx _dword_ptr_[r
0 ]_0,</w>
_ptr _
word _ptr_
ax +0x1
f s
fs :
word_ptr_ fs:
push _rbx,</w>
0] _rax,</w>
[ 0x
_q word_ptr_fs:
_r 8
_qword_ptr_fs: [0x
_qword_ptr_fs:[0x 28],</w>
je_0x 2
sp +
_ word_ptr_[r
cmp _dword_ptr_[r
lea_rdi _[rip+0x
1 0
_edx _edx,</w>
sp +8],</w>
pop _r12,</w>
cmp _qword_ptr_[r
mov_dword_ptr_[r sp+0x
l ,</w>
_ 0,</w>
add _rax
_e bx,</w>
_edi ,</w>
test _r
_ 2,</w>
jmp_0xfffffffffffff e
3 8],</w>
2 ],</w>
call_0xffffffffffff e
mov_r1 3
jne_0x 1
_al ,</w>
_[r ax
] _eax,</w>
e _
ip+0x2 0
_xmm word_ptr_[r
movsx d
4 0],</w>
lea_r cx
_0x1 0,</w>
- 0x
1 8],</w>
f e
bx +0x1
_ 4,</w>
movzx_eax _byte_ptr_[r
j a
mov_r1 4
mov_r 8d
push _r12,</w>
9 ],</w>
_e bp,</w>
sp+0x1 0],</w>
_r12 d,</w>
mov_qword_ptr_[r sp+0x1
_e bx
_r8 d,</w>
_ 3,</w>
mov_dword_ptr_[r bp-0x
lea_rdx _[rip+0x
mov_r1 5
re t</w>
_0x 6
call _0x1
je_0xffffffffffff ff
j b
+ 1],</w>
mov_ecx _dword_ptr_[r
d q
lea_rax _[r
pop _r13,</w>
mov_r 8
xor _edx_edx,</w>
1 0],</w>
_qword_ptr_[r sp+0x
cmp _byte_ptr_[r
je_0x 3
_0x 5
di +0x
sp+0x1 8],</w>
1 d
_esi _esi,</w>
2 0
mov_rdi _r12,</w>
_r1 0
mov_rax_qword_ptr_[r sp+0x
_ecx _ecx,</w>
_0x2 0,</w>
mov a
sh l
mov_esi _1,</w>
4 8],</w>
]_ xmm
xor _r
call_0xffffffffffff d
_rsp ,</w>
6 ],</w>
d _eax,</w>
5 8],</w>
_r 9
5 0],</w>
mov_esi _0x4
p s
] _rax,</w>
_xmm 0
3 ],</w>
0 0,</w>
push _r13,</w>
a ],</w>
_dword_ptr_[r sp+0x
_e bp
_r 8,</w>
_r13 d,</w>
_0x 8
call_0xfffffffffff d
mov_e bx
7 ],</w>
5 ],</w>
4 ]
test _byte_ptr_[r
j l
mov_eax_dword_ptr_[r bp-0x
jne_0x 2
j e_
e ],</w>
7 0],</w>
_edi _edi,</w>
_ 5,</w>
b b
6 0],</w>
bx ],</w>
mov_rdi_qword_ptr_[r sp+0x
call_0xffffffffffff c
_0x 7
cmp _rax
f ],</w>
_r12 d
6 4,</w>
_0xffffffff ,</w>
bp- 8],</w>
pop _r14,</w>
+r ax
lea_rdx _[r
mov_qword_ptr_[r sp+
xor _esi_esi,</w>
mov_r 9
_0x ffff
test _al
f d
jmp_0xfffffffffffff d
sub_rsp _8,</w>
mov_rax _qword_ptr_fs:[0x28],</w>
s e
b ],</w>
sp ],</w>
mov_edi _0x4
mov_eax _0,</w>
ps _xmmword_ptr_[r
- 1,</w>
_0x1 8,</w>
_r14 d,</w>
je_0x 4
mov_r 9d
1 1
add _r
mov_rax_qword_ptr_[r ip+0x2
mov_rdi _r13,</w>
lea_r 8
c mov
xor _ecx_ecx,</w>
call _0x2
mov_rbx _qword_ptr_[r
+0x1 0],</w>
mov_e bp
12 +0x
and _eax
c ]
jmp _0x1
15 +0x
_r9 d,</w>
sh r
add_rsp _8,</w>
8d _r8d,</w>
di ],</w>
push _r14,</w>
movzx _edx
+ 4],</w>
mov_rdx _rax,</w>
_r15 d,</w>
lea_rax _[rip+0x
lea_rcx _[rip+0x
mov_qword_ptr_[rsp+0x 2
mov_rax_qword_ptr_[r ax+0x
_qword_ptr_[r bp-0x
+r dx
_rdi _rdi,</w>
call_0xfffffffffff c
_r13 d
lea_rsi _[r
test _rdi_rdi,</w>
ax ]
mov_rdx_qword_ptr_[r bp-0x
6 8],</w>
xor _edi_edi,</w>
mov_rsi _rax,</w>
2 4
f c
8 0],</w>
call_0xffffffffffff b
1 c
lea_rdi _[r
_r 9,</w>
mov_rax_qword_ptr_[rbp-0x 18],</w>
mov_rdi _r14,</w>
mov_edi _1,</w>
3 4
mov_rax_qword_ptr_[r bp-8],</w>
mov_r1 0
8] _rdx,</w>
mov_rdi _r15,</w>
d ],</w>
mov dq
_ -1,</w>
7 0
b r
nd br
ndbr 64,</w>
e ndbr64,</w>
3 0
ax +8],</w>
j g
pop _r15,</w>
2 8
mov_dword_ptr_[r sp+0x1
mov_esi _dword_ptr_[r
jb e_0x
_r14 d
mov_rax_qword_ptr_[r ax],</w>
_ c
mov_edi _dword_ptr_[r
13 +0x
je_0x 5
test_al _al,</w>
mova ps_xmmword_ptr_[r
14 +0x
_ 7,</w>
7 8],</w>
si _rsi,</w>
3 c
jl e_0x
2 c
cmp _r
1 8
test_r si_rsi,</w>
3 8
5 a
00 0,</w>
_d l,</w>
mov_rbx _rax,</w>
1 a
call_0xffffffffffff a
mov_rsi _rbp,</w>
e c
jmp_0xfffffffffffff c
_0x a,</w>
lea_r8 _[rip+0x
xor_r 8d_r8d,</w>
n e
mov _word_ptr_[r
1 6
dx +0x
4 0
je_ 7,</w>
1 b
mov_rbp _rsp,</w>
1 9
jne_0x 3
mov_r12 d
push _r15,</w>
8] _eax,</w>
8 0
e 0],</w>
_xmm 1
+rax *
mov_rsi_qword_ptr_[r sp+0x
5 0
call _qword_ptr_[r
_r15 d
mov_rbx _rdi,</w>
mov_qword_ptr_[rsp+0x 3
_r1 1
call_0xfffffffffff b
add_rax _rdx,</w>
f b
mov_qword_ptr_[r sp
mov_rsi _rbx,</w>
cmp _al
8] _rdi,</w>
1 7
6 0
2 2
mov_rdx_qword_ptr_[r sp+0x
jmp _0x
6 c
bp ],</w>
j s
9 0],</w>
_0xffffffffffff ff
ax+0x1 0],</w>
5 c
add _rdx
cmp _edx
4 a
3 a
cmp_dword_ptr_[r bp-0x
]_xmm 0,</w>
u l
m ul
8 6
_ebx _ebx,</w>
ax +
9 0
lea_rcx _[r
call_0xfffffffffff a
mov_eax_dword_ptr_[r sp+0x
4 c
test _edx_edx,</w>
+0x1 8],</w>
si +0x
mov_rsi _r12,</w>
f a
1 e
call _0x4
add _eax
_0x4 0,</w>
_rdx _rdx,</w>
mov_qword_ptr_[rsp+0x 4
3 7
3 6
2 0]
s d
2 a
_0x3 0,</w>
se t
c dq
_[rax +1],</w>
mov_edx _5,</w>
9 c
5 4
mov_qword_ptr_[rbp-0x 1
3 d
- 1],</w>
test _rdx_rdx,</w>
_ 6,</w>
al ,</w>
]_ al,</w>
jne_0xffffffffffffff e
9 a
movsxd _rdx
5 8
9 b
je_0x 6
mov_r8 _qword_ptr_[r
mov_edx _1,</w>
_d l
3 b
cmp _rdi
mov_eax _1,</w>
jne_0xffffffffffff fe
2 6
9 8],</w>
9 4
mov_eax_dword_ptr_[r ip+0x2
2 7
jne_0x 4
1 4],</w>
_r12d _r12d,</w>
_xmm0 _xmm
8 8],</w>
sub _eax
3 e
12 ],</w>
cdq e,</w>
lea_rax _[rsp+0x
_0x2 8,</w>
movzx_edx _byte_ptr_[r
8 8
_r si
_r1 0,</w>
mov_edi _eax,</w>
mov_dword_ptr_[r sp+
2 d
5 7
_ebp _ebp,</w>
6 6
]_ 2,</w>
9 7
bx +8],</w>
2 b
5 b
_dword_ptr_[r bp-0x
5 d
+r cx
mov_r13 d
mov_edx _eax,</w>
je_0x 7
_r10 d,</w>
0] _rdx,</w>
mov_rax_qword_ptr_[rbp-0x 28],</w>
lea_r 9
4 7
mov_rbp _rax,</w>
9 6
9 e
9 8
5 e
cmp_qword_ptr_[r bp-0x
mov_qword_ptr_[rsp+ 8]_rax,</w>
je_0xffffffffffff fe
lea _eax
4 8
mov_qword_ptr_[r bx+0x
movaps_xmmword_ptr_[r sp+0x
f 7
jmp _0x2
mov_rsi _rdx,</w>
lea_rax_[r bp-0x
2 e
movdq a
movzx _ecx
cmov e
5 6
mov_rcx_qword_ptr_[r sp+0x
mov_edx _0x4
mov_edx _0x1
movzx_eax_byte_ptr_[r ax],</w>
ax+0x1 8],</w>
4 b
mov_qword_ptr_[r bp-
mov_dword_ptr_[r ip+0x2
9d _r9d,</w>
sub _rax
c c
ax ,</w>
f 0],</w>
bx _rbx,</w>
movzx_eax _word_ptr_[r
b s
8 0,</w>
si ],</w>
a 0],</w>
mov_qword_ptr_[r ax+0x
mov_qword_ptr_[r ip+0x2
mov_r14 d
test_r bx_rbx,</w>
jmp_0xfffffffffffff b
2 4],</w>
movs d
* 8],</w>
v e,</w>
lea ve,</w>
shl _rax
0] _eax,</w>
ax ]_0,</w>
movsxd _rax
mov_rbp _rdi,</w>
se te
call_0xffffffffffff 7
mov_rbp _qword_ptr_[r
13 ],</w>
4 4
mov_rsi _r13,</w>
cmp _rdx
_c l,</w>
i mul
lea_eax _[r
1 f
test _
a a
mov_r8d _dword_ptr_[r
bx +
i n
8 c
lea _edx
e d
dx ],</w>
4 d
ff ,</w>
6 d
s a
sa r
00 00
di +0x1
in c
1 0,</w>
8 a
8] _rcx,</w>
5 5
8 7
6 b
_xmm 2
_r13d _r13d,</w>
bx+0x1 0],</w>
3 f
e e
6 a
add_r bx
b 0],</w>
15 ],</w>
mov_r12 _qword_ptr_[r
_0x8 0,</w>
xor _rcx
xor _rax
9 9
_0xffff fff
mov_r15 d
8 b
jne_0xffffffffffffff d
xor_rcx _qword_ptr_fs:[0x28],</w>
_r1 1,</w>
mov_rax_qword_ptr_[rbp-0x 10],</w>
6 7
push _rax,</w>
e b
mov_ebx _eax,</w>
s bb
3 5
mov_rcx _rax,</w>
f 0
mov_eax_dword_ptr_[r ax],</w>
mov_rax_qword_ptr_[r bx+0x
lea_r bx
mov_r12 _rax,</w>
]_ 4,</w>
* 4],</w>
mov_r12 d_eax,</w>
mov_r10 d
ja e_0x
add_rsp _0x18,</w>
cx +0x
i p
call_0xffffffff ff
mov_rax_qword_ptr_[r sp+8],</w>
_ 9,</w>
lea_rsi _[rsp+0x
_r10 d
_r11 d,</w>
3 2
lea _r12
ip -0x
6 4
9 8,</w>
jmp_0xffffffffffffff a
mov_rax_qword_ptr_[rbp-0x 38],</w>
c 0
jmp_0xffffffffffffff b
2 c],</w>
xor_rax _qword_ptr_fs:[0x28],</w>
re p
c 0],</w>
mov_rdx _r12,</w>
mov_qword_ptr_[rsp+0x 5
test _ecx_ecx,</w>
9 0,</w>
jmp_0xffffffffffffff c
_r14d _r14d,</w>
9 f
p cmp
mov_r9 _qword_ptr_[r
jne_0x 5
lea _r13
cmp_eax _1,</w>
b 8],</w>
xor _ebx_ebx,</w>
lea_rdi _[rsp+0x
mov_rdx _rbx,</w>
3 4],</w>
8 e
8 4
_r15d _r15d,</w>
mov_edx _0x
6 e
7 c
+r ax],</w>
_r 8d
lea_r bp
7 d
mov_edx_dword_ptr_[r bp-0x
ax +r
cmp _ecx
+ 2],</w>
mov_dword_ptr_[r bx+0x
lea_rdx _[rax
_0x3 8,</w>
mov_rsi _r14,</w>
2 5
jmp_0xfffffffffffff a
xor_r 9d_r9d,</w>
9 5
call_0xfffffffffffff d
ea ,</w>
cmp _ebx
mov_esi_0x4 0
lea_rdx _[rsp+0x
je_0x a
movdq u
]_ 8,</w>
mov_rax_qword_ptr_[rbp-0x 20],</w>
mov_ecx _eax,</w>
mov_rax_qword_ptr_[r ip+0x20
2 0,</w>
7 a
jn e_
add _rdi
3 3
mov_r1 1d
jne_0xffffffffffff f
0] _rsi,</w>
4 ]_eax,</w>
2 f
sub _rdx
mov_eax _0xffffffff,</w>
p xor
mov_rdi_qword_ptr_[r ip+0x2
mov_qword_ptr_[rbp-0x 2
mov_qword_ptr_[rbp- 8]_rax,</w>
a 8],</w>
mov_qword_ptr_[rsp+0x1 8]_rax,</w>
and _edx
_0x c,</w>
mov_rax_qword_ptr_[rbp-0x 58],</w>
7 b
mov_r13 _qword_ptr_[r
mov_eax_dword_ptr_[r ax+0x
jmp_0xffffffffffffff d
1 8,</w>
mova bs
mov_rax_qword_ptr_[r bp+0x
d 0],</w>
4 ]_0,</w>
test _r12
e 0
mov_rsi _rcx,</w>
xor _r12d_r12d,</w>
mov_qword_ptr_[r ax]
bp _rbp,</w>
8 ]_1,</w>
mov_byte_ptr_[r sp+0x
6 f
8 +0x
jmp _0x3
dx +0x1
bx+0x1 8],</w>
mov_qword_ptr_[rbp-0x 4
test_r bp_rbp,</w>
2 3
movzx _esi
b 0
9 3
lea _r14
mov_ebp _eax,</w>
1 ]
xor _ebp_ebp,</w>
je_0xffffffffffff f
mov_qword_ptr_[r ax+0x1
a 0
cmov ne
0] _rcx,</w>
_r1 1d
cmp _
or _eax
_c l
mov_rdx _rbp,</w>
test _esi_esi,</w>
8 f
c 8],</w>
5 f
4 e
_xmm1 _xmm
c 0,</w>
cmp_eax _-1,</w>
_rcx _rcx,</w>
7 7
jmp_0xffffffffffffff 9
e_0xffffffffffff ff
sub _edx
call_0xfffffffffffff c
mov_rdi_qword_ptr_[r sp+8],</w>
je_0x b
add _dword_ptr_[r
6 0,</w>
mov_r1 1
jmp_0xffffffffffffff 8
mov_rax_qword_ptr_[r ax+8],</w>
mov_edx_dword_ptr_[r sp+0x
mov_r14 _qword_ptr_[r
lea _ecx
movzx_eax _al,</w>
9 2
mov_dword_ptr_[r ax+0x
c ]_eax,</w>
jmp_0xffffffffffff e
jmp_0xffffffffffffff 7
12 +0x1
mov_r15 d_eax,</w>
_r bx
jne_0xffffffffffff fd
_byte_ptr_[r si
mov_esi _0x1
mov_qword_ptr_[rsp ]
]_ ax,</w>
mov_dword_ptr_[r sp
mov_r15 _qword_ptr_[r
jne_0x 7
4 0,</w>
3 c],</w>
add_r si
3 8,</w>
mov_qword_ptr_[rsp+ 8]
e 8,</w>
mov_esi _eax,</w>
mov_rcx_qword_ptr_[r bp-0x
3 0,</w>
sub_rsp _0x18,</w>
mov_qword_ptr_[rbp-0x 3
bp +8],</w>
_0x f
cmp_r bx
_r 9d
jne_0x 6
2 8,</w>
je_0x 9
add _rcx
di v
e 0,</w>
mov_qword_ptr_[rsp+0x 6
mov_rdx _r13,</w>
jne_0xffffffffffff fff
_xmm0_xmm 0,</w>
mov_rax_qword_ptr_[r sp+0x18],</w>
call_0xfffffffffffff b
jne_0xffffffffffffff c
8 5
test _rcx_rcx,</w>
mov_eax _edx,</w>
4 6
2 0]_0,</w>
mov_rax_qword_ptr_[r sp+0x10],</w>
mov u
movzx_ecx _byte_ptr_[r
sub_rsp _0x10,</w>
test_r12 _r12,</w>
c a
je_0x 8
jn s
2 9
15 +0x1
mov_rax _rdx,</w>
mov_rsi _r15,</w>
4 f
mov_dword_ptr_[r ip+0x
lea_r9 _[rip+0x
mov_rbp _rsi,</w>
_[r dx
test _edi_edi,</w>
add_rax _1,</w>
_0xffffffffffff fff
_xmm0 _xmmword_ptr_[r
mov_r9d _dword_ptr_[r
1 c,</w>
call_0xfffffffffffff a
1 d,</w>
mov_edi_0x4 0
je_0xffffffffffff fd
1 4,</w>
jmp_0xffffffffffffff 5
mov_qword_ptr_[r bp+0x
mov_r13 _rax,</w>
mov_rax_qword_ptr_[r ip+0x
_0x4 0
test _ebx_ebx,</w>
call_0x a
7 e
1 b,</w>
mov_edx _0x2
call_0xffffffffffff ff
add _qword_ptr_[rbp-0x
1 1,</w>
je_0x c
_0x3 f,</w>
cmp _esi
di +8],</w>
d 0
call_0x 3
movu ps_xmmword_ptr_[r
cmp _ebp
1 3,</w>
1 2,</w>
1 6,</w>
set ne
1 e,</w>
4 5
mov_rbx _rsi,</w>
]_ b
1 9,</w>
1 5,</w>
8] _edx,</w>
s b
test _r13
d 8,</w>
mov_rdi_qword_ptr_[r ax],</w>
cmp _dl
_0x1 6,</w>
6 8
movdqa _xmm
mov_ecx_dword_ptr_[r sp+0x
1 f,</w>
jmp _0xffffffff
mov_qword_ptr_[rsp+0x1 0]_rax,</w>
mov_qword_ptr_[r bx+0x1
mov_edi _3,</w>
6 5
je_ 9,</w>
mov_dword_ptr_[rsp+0x 3
_0x f,</w>
jmp_0xffffffffffffff 6
_0x a
1 7,</w>
je_0x a,</w>
call_0x b
call_0xfffffffffffff e
e 8],</w>
mov_rdi_qword_ptr_[r ip+0x
1 c],</w>
si +0x1
7 f
d 8],</w>
ax +4],</w>
9 c,</w>
add_rsp _0x10,</w>
_qword_ptr_[r ip+0x
pxor _xmm0_xmm0,</w>
mov_rax_qword_ptr_[rbp-0x 48],</w>
sp+ 4],</w>
jmp _0x4
mov_rdx_qword_ptr_[r ip+0x2
add _edx
lea _r15
movsxd_rax _dword_ptr_[r
call_0xffffffffffff 0
1 a,</w>
shl _rdx
test _r12d_r12d,</w>
c ]_0,</w>
9 d,</w>
mov_eax _ebx,</w>
jmp_0xffffffff fff
test _dl
xor _r13d_r13d,</w>
mov_qword_ptr_[r bx
mov_rax_qword_ptr_[rbp-0x 30],</w>
v t
c vt
9 b,</w>
9 4,</w>
add_r bp
9 7,</w>
je_0x d
bp+0x 10],</w>
4 8,</w>
9 2,</w>
e _8,</w>
f 4,</w>
_0x2 f,</w>
mov_byte_ptr_[r bp-0x
9 f,</w>
9 a,</w>
_0x1 0
w ,</w>
9 9,</w>
4 2
lea_rdx_[r bp-0x
mov_qword_ptr_[r ip+0x
9 6,</w>
je_0x c,</w>
push _0,</w>
call_0xffffffffffff 8
mov_rdx_qword_ptr_[r ax],</w>
jne_0xffffffffffffff b
9 1,</w>
mov_rdx_qword_ptr_[r ax+0x
9 5,</w>
9 e,</w>
mov_rdi_qword_ptr_[r bx+0x
9 3,</w>
mov_dword_ptr_[r ax]
c 8,</w>
b e
mov_rbx _qword_ptr_[rsp+0x
5 0,</w>
test _ebp_ebp,</w>
si l,</w>
3 c,</w>
mov_rdi_qword_ptr_[r ip+0x20
si +
mov_r12 _rdi,</w>
_0x1 f,</w>
mov_rcx _rbx,</w>
call_0x 7
1 ]_0,</w>
]_b yte_ptr_[r
14 +0x1
mov_qword_ptr_[r dx
mov_qword_ptr_[rsp+0x 7
cmp _r12d
mov_rax_qword_ptr_[r sp],</w>
mov_qword_ptr_[r di
3 d,</w>
fff ,</w>
c b
mov_rax_qword_ptr_[r bx],</w>
call_0xffffffffffff 9
5 8,</w>
je_0x b,</w>
sb _byte_ptr_[rsi
sb_byte_ptr_[rsi ]_byte_ptr_[r
sb_byte_ptr_[rsi]_byte_ptr_[r di],</w>
rep e_
repe_ cmp
repe_cmp sb_byte_ptr_[rsi]_byte_ptr_[rdi],</w>
13 +0x1
mov_edx _2,</w>
c d
4 c],</w>
cmp _edi
jmp_0xffffffffffffff 4
sub_rsp _0x20,</w>
_0xffff ff
3 3,</w>
3 5,</w>
e f
di +0x10],</w>
3 4,</w>
3 7,</w>
mov_rdi_qword_ptr_[r sp+0x10],</w>
mov_rax_qword_ptr_[r ax+0x10],</w>
6 8,</w>
2 c,</w>
3 9,</w>
8 8,</w>
3 6,</w>
cmp_qword_ptr_[r sp+0x
jne_0x a
cmp_dword_ptr_[r sp+0x
mov_rdx _r14,</w>
or _dword_ptr_[r
e b,</w>
b a
cmp _rcx
3 f,</w>
b 8,</w>
3 2,</w>
3 1,</w>
test _r14
je_0x f,</w>
mov_qword_ptr_[r bp
]_ -1,</w>
cmp_rdi _rax,</w>
cmp_rax _qword_ptr_[rbp-0x
mov_rcx_qword_ptr_[r sp+8],</w>
3 b,</w>
3 a,</w>
e f,</w>
test _r15
mov_r14 _rax,</w>
mov_dword_ptr_[rsp+0x 2
mov_eax_dword_ptr_[r bx+0x
2 d,</w>
mov_qword_ptr_[rsp ]_rax,</w>
2 4,</w>
+rdx *
+rdx ],</w>
cmp _r12
7 4
d a
mov_rsi_qword_ptr_[r ax],</w>
3 e,</w>
- 8],</w>
8] _rsi,</w>
sp+0x1 c],</w>
and _ecx
2 e,</w>
mov_qword_ptr_[rsp+0x2 8]_rax,</w>
_0x b,</w>
mov_eax _r12d,</w>
mov_r10 _qword_ptr_[r
mov_rcx _r12,</w>
xor _r15d_r15d,</w>
2 1,</w>
mov_r12 _rsi,</w>
f 0,</w>
2 9,</w>
2 6,</w>
4] _edx,</w>
sp+0x1 0
movzx _edi
call_0x 6
test_r13 _r13,</w>
7 8
test_r 8d_r8d,</w>
lea_rdi _[rax
jne_0xffffffffffff fc
_ ax,</w>
5 4],</w>
d 0,</w>
2 5,</w>
je_0x e,</w>
mov_rcx _rdx,</w>
e 9,</w>
jne_0x c,</w>
add_rsp _0x28,</w>
e 2,</w>
mov_dword_ptr_[r bp+0x
_0x d,</w>
2 b,</w>
mov_r15 _rax,</w>
7 6
2 a,</w>
sp+0x1 4],</w>
call_0x 5
sete _al,</w>
2 3,</w>
dx +8],</w>
2 2,</w>
e 6,</w>
b _xmm
xor _r14d_r14d,</w>
4 4],</w>
mov_rsi_qword_ptr_[r sp+8],</w>
+rcx ],</w>
mov_dword_ptr_[rsp+0x c]
movzx_edx _word_ptr_[r
call_0xffffffffffff 6
mov_byte_ptr_[r ax]
2 f,</w>
mov_rdi_qword_ptr_[r sp+0x18],</w>
mov_esi _0x2
e d,</w>
add_eax _1,</w>
mov_ecx _1,</w>
mov_r14 d_eax,</w>
mov_eax_dword_ptr_[r ip+0x
si -0x
ja _0x1
2 7,</w>
mov_qword_ptr_[r ax+
e 3,</w>
mov_rax_qword_ptr_[rbp-0x 40],</w>
add_rsp _0x20,</w>
d c
test _r13d_r13d,</w>
lea_edx _[r
lea_rdx _[rax+1],</w>
mov_rax _rbx,</w>
8] _ecx,</w>
add _r12
e 5,</w>
mov_rdi_qword_ptr_[r bx],</w>
f 8,</w>
di l,</w>
call _rax,</w>
4 ]_1,</w>
mov_dword_ptr_[r ip+0x20
jmp _7,</w>
_0x4 8,</w>
12 +8],</w>
d b
e 1,</w>
mov_rdi _rdx,</w>
je_0x1 2,</w>
7 0,</w>
jmp _0x5
7 5
je_0x1 0
f 8],</w>
p and
ne g
d 2,</w>
lea_r12 _[r
f 6,</w>
mov_eax _ebp,</w>
movsxd _rcx
e 7,</w>
call_0xfffffffffff ea
_xmm 1,</w>
ja _0xffffffffffffff
7 8,</w>
mov_qword_ptr_[r 12
pcmp g
pcmpg t
call_0x c
movsxd_rdx _eax,</w>
pcmpgt b_xmm
_xmm 0,</w>
mov_rax_qword_ptr_[r di+0x
o t
n ot
mov_rax_qword_ptr_[r di],</w>
]_ 3,</w>
jmp_0xffffffffffffff 0
di l
e c,</w>
movsx _eax
test _r14d_r14d,</w>
call_qword_ptr_[r ax+0x
jne_0xffffffffffffff a
mov_qword_ptr_[rax] _rdx,</w>
00 00,</w>
mov_esi _0,</w>
b 0,</w>
2 8]_0,</w>
e e,</w>
8 1,</w>
je_0xffffffffffff fc
mov_rax_qword_ptr_[rsp+0x 28],</w>
mov_r13 d_eax,</w>
+rax* 4],</w>
mov_qword_ptr_[r ip+0x20
cx ],</w>
mov_edi _0x6
e 4,</w>
pop _rdx,</w>
mov_eax_dword_ptr_[r ip+0x20
cmp _r14d
8 d,</w>
call_0xfffffffffff 9
mov_rdi_qword_ptr_[r bp-0x
je_0x d,</w>
dx +
d ec
sd _xmm0
d f,</w>
lea_rcx _[rsp+0x
mov_esi _0x5
a h
je_0x 12
jmp _rax,</w>
mov_rdi_qword_ptr_[r sp],</w>
mov_r10d _dword_ptr_[r
mov_ebx _dword_ptr_[r
_0x5 8,</w>
cmp_eax _2,</w>
_ -0x
_r10d _r10d,</w>
c l,</w>
set a
si l
_b l
je_0x1 1,</w>
_r bp
mov_rsi_qword_ptr_[r bp-0x
8 7,</w>
cmp _r13d
_xmm 3
mov_dword_ptr_[r ax+0x1
mov_esi _dword_ptr_[rsp+0x
_qword_ptr_[rsp+0x 20],</w>
8 9,</w>
movzx_esi _byte_ptr_[r
mov_rax_qword_ptr_[r ax+0x18],</w>
6 d,</w>
8 a,</w>
shl_rax _4,</w>
8 6,</w>
sub _rcx
8 b,</w>
8 c,</w>
lea_rbx _[r
mov_qword_ptr_[rsp+0x1 0]
0] _edx,</w>
test_r15 _r15,</w>
8 f,</w>
8 e,</w>
mov_ecx _0xffffffff,</w>
xor _eax
6 c,</w>
f e,</w>
test_r14 _r14,</w>
_0xffff 86
mov_dword_ptr_[rsp+0x 4
sub_eax _1,</w>
lea_rbp _[r
mov_r8d _eax,</w>
cmp _word_ptr_[r
cmp_r si
call_0x1 0
cmp _r13
8 5,</w>
5 c],</w>
mov_rax_qword_ptr_[rsp+0x 20],</w>
test_dl _dl,</w>
add _qword_ptr_[r
c d,</w>
5 d,</w>
f d,</w>
4 f,</w>
di +
8 3,</w>
mov_edi _7,</w>
sub_rsp _0x28,</w>
call_0xfffffffffffe d
lea_r13 _[r
8 4,</w>
lea_r8 _[r
6 1,</w>
lea _esi
5 5,</w>
pcmp e
pcmpe q
5 c,</w>
push _rdx,</w>
+rax* 8],</w>
_0x6 8,</w>
6 3,</w>
] _edx,</w>
5 3,</w>
f 7,</w>
call_0x d
sub_rsp _0x
cmp_rdx _rax,</w>
cmp_r bp
4 c,</w>
5 6,</w>
mov_edx _0,</w>
pand _xmm
mov_qword_ptr_[rsp+0x 8
mov_ecx _0x1
mov_rdx_qword_ptr_[r sp+8],</w>
call_0x 8
6 5,</w>
4 1,</w>
mov_qword_ptr_[rbp-0x 5
add _ecx
mov_edx_dword_ptr_[r ax+0x
4 d,</w>
6 9,</w>
5 a,</w>
b d
b f,</w>
5 1,</w>
call_0xfffffffffffff 0
5 b,</w>
5 4,</w>
test _r15d_r15d,</w>
4 4,</w>
5 e,</w>
5 9,</w>
6 e,</w>
5 f,</w>
4 2,</w>
je_0x1 8,</w>
mov_ecx _0x4
call_0xfffffffffff 8
6 4],</w>
mov_dword_ptr_[rbp-0x 4
4 5,</w>
f 9,</w>
15 +8],</w>
6 b,</w>
6 7,</w>
mov_rax_qword_ptr_[rax+0x 70],</w>
mov_byte_ptr_[r ax]_0,</w>
f a,</w>
f b,</w>
lea_r9 _[r
7 f,</w>
f 1,</w>
7 d,</w>
6 6,</w>
_0x e,</w>
4 9,</w>
8 2,</w>
6 2,</w>
4 6,</w>
* 4
f 5,</w>
4 b,</w>
5 2,</w>
4 e,</w>
6 f,</w>
6 c],</w>
7 5,</w>
b c
f 2,</w>
mov_edx _0x3
6 a,</w>
f c,</w>
7 9,</w>
_xmm0_xmm 1,</w>
13 +8],</w>
call_0xffffffffffff 4
mov_rcx _rbp,</w>
4 a,</w>
8] _r9,</w>
add _ebx
mov_qword_ptr_[rbp-0x1 8]_rdi,</w>
d e,</w>
si 2
cvt si2
_qword_ptr_[rsp+0x 28],</w>
7 2,</w>
f 3,</w>
b d,</w>
5 7,</w>
4 3,</w>
mov_rdx_qword_ptr_[r bx+0x
7 3,</w>
call_0xfffffffffffe c
7 c,</w>
c f,</w>
jg _0xffffffffffffff
movsxd _rsi
-0x 18],</w>
7 e,</w>
mov_rsi _rsp,</w>
4 7,</w>
7 1,</w>
call_0xfffffffffffe e
7 b,</w>
lea_r14 _[r
_xmm1 _xmmword_ptr_[r
7 4,</w>
je_0x1 0,</w>
mov_rdx _r15,</w>
add _r13
and_eax _1,</w>
7 a,</w>
movsxd_rdx _edx,</w>
a 0,</w>
14 +8],</w>
jg e_0x
7 6,</w>
mov_r8d _dword_ptr_[rsp+0x
movabs _rax
b 9,</w>
jmp_0xffffffffffff d
]_ cl,</w>
jmp_0xfffffffffffff ea
sub _ecx
_dword_ptr_[r ip+0x
mov_qword_ptr_[rbp-0x1 8]_rax,</w>
d b,</w>
* 8+0x
di -0x
jmp _0x6
3 8]_0,</w>
setne _al,</w>
c c,</w>
mov_rdi_qword_ptr_[r bp+0x
mov_qword_ptr_[rbp-0x1 0]_rax,</w>
movzx _r8d
_xmm 2,</w>
movsd _xmm0
3 0]_0,</w>
d c,</w>
ax+0x 20],</w>
c e,</w>
mov_rcx _r13,</w>
7 7,</w>
jne_ 9,</w>
mov_rsi_qword_ptr_[r sp+0x10],</w>
pcmpeq b
bp +
c 2,</w>
b 5,</w>
mov_rdi_qword_ptr_[rsp+0x 20],</w>
mov_eax _ecx,</w>
je_0x1 6,</w>
test _r8
mov_qword_ptr_[rsp+0x2 0]_rax,</w>
j e_8,</w>
mov_qword_ptr_[r cx
b 7,</w>
_0x2 d,</w>
c 7,</w>
c 9,</w>
b c,</w>
mov_rdi _rcx,</w>
c a,</w>
b 4,</w>
b 6,</w>
3 9
] _dl,</w>
_dword_ptr_[r ip+0x2
6 8]_0,</w>
add _dword_ptr_[rbp-0x
c 5,</w>
c 1,</w>
shl _eax
c 4,</w>
mova ps
call_0xffffffffffff ea
8] _rbx,</w>
b 2,</w>
c 6,</w>
je_0x1 5,</w>
]_ dx,</w>
1 1],</w>
c 3,</w>
je_0x1 3,</w>
b a,</w>
b b,</w>
mov_r12 _rdx,</w>
xor_r bx
mov_r8 _rax,</w>
d 6,</w>
call_0xffffffffffff 5
w a
mov_qword_ptr_[rsp+0x 9
_0x2 2,</w>
d a,</w>
add_rdx _rax,</w>
wa p
bs wap
mov_dword_ptr_[rsp+ 8]
]_xmm 1,</w>
add_rsp _0x
_b l,</w>
shr _eax
mov_dword_ptr_[r bx
lea_rsi_[rip+0x 4
b 1,</w>
mov_rsi_qword_ptr_[r sp+0x18],</w>
12 +0x10],</w>
mov_word_ptr_[r sp+0x
b 3,</w>
b e,</w>
c b,</w>
bx +1],</w>
xor_rbx _qword_ptr_fs:[0x28],</w>
mov_rax _rcx,</w>
ja _0xffffffffffff
je_0x1 4,</w>
mov_qword_ptr_[r di+0x
movsxd _rdi
add _r14
shr _edx
d d,</w>
2 0]_rax,</w>
mov_rax_qword_ptr_[r bp],</w>
lea_rax_[r ip-0x
test_r 9d_r9d,</w>
mov_edi_dword_ptr_[r ax],</w>
mov_dword_ptr_[r ax
call_0xfffffffffffe b
mov_rcx_qword_ptr_[r ip+0x2
d 4,</w>
0] _r8,</w>
ax+0x 28],</w>
sub_rdx _rax,</w>
] _rdx,</w>
d 7,</w>
8 _xmm
call_0xfffffffffff 7
si +8],</w>
mov_edi _ebp,</w>
mov_edi _ebx,</w>
cmp _r14
rep _
lea_rsi_[rip+0x 2
je_0x1 7,</w>
a 8,</w>
mov_eax_dword_ptr_[r bp+0x
d 1,</w>
mov_rdx _rcx,</w>
je_0x1 b,</w>
_0x7 f,</w>
_0x1 000,</w>
d 3,</w>
cmp _cl
d 5,</w>
d 9,</w>
je_0x1 a,</w>
0 ]_1,</w>
bx +r
mov_dword_ptr_[rsp+0x 5
mov_r11 _qword_ptr_[r
mov_edi _2,</w>
cmp_qword_ptr_[r bx+0x
mov_esi _2,</w>
00 0
pop _rcx,</w>
mov_rax_qword_ptr_[rbp-0x 68],</w>
js _0x1
lea_edx _[rax
mov_qword_ptr_[r 13
mov_rbx _rdx,</w>
mov_byte_ptr_[r dx
mov_rcx_qword_ptr_[r sp+0x18],</w>
or _edx
8 70
sub _rsi
8] _r8,</w>
je_0x1 d,</w>
_0x5 0,</w>
mov_rdi _rsp,</w>
mov_ecx _edx,</w>
mov_rax _r12,</w>
15 +0x10],</w>
cmp _r15d
add _r15
cmp _r15
jb _0xffffffffffffff
mov_qword_ptr_[rsp+0x3 8]_rax,</w>
bx+0x 20],</w>
r o
mov_rax_qword_ptr_[rax+0x 20],</w>
jmp _3,</w>
_qword_ptr_[rsp+0x 30],</w>
mov_dword_ptr_[r bx+0x1
mov_esi _edx,</w>
bx+0x 28],</w>
lea _edi
_0x7 8,</w>
je_0x1 c,</w>
f 2
7 4],</w>
1 0]_0,</w>
ax+0x 4
_r11d _r11d,</w>
mov_r11d _dword_ptr_[r
add_rsp _0x38,</w>
mov_dword_ptr_[r ax+
mov_r13 _rsi,</w>
jne_0x 10
mov_rdi_qword_ptr_[r sp+0x1
lea_edx _[rax+1],</w>
mov_edi _dword_ptr_[rsp+0x
mov_rbp _rdx,</w>
bp- 4],</w>
jne_0xffffffffffff fb
_0x3 a,</w>
mov_edx _r12d,</w>
shr _rax
mov_edi _0x5
mov_qword_ptr_[r 12+0x
mov_dword_ptr_[r bp-
test_ dil
call_0xfffffffffffe f
jb e_0xffffffffffffff
_xmm2 _xmmword_ptr_[r
mov_rdi_qword_ptr_[rsp+0x 28],</w>
ro l
dx +r
mov_rsi_qword_ptr_[r ip+0x2
mov_rdx _rsi,</w>
movsxd_rdx _dword_ptr_[r
jne_0x1 3,</w>
test _cl
mov_r13 _rdi,</w>
jb e_0xffffffffffff
mov_rax_qword_ptr_[rsp+0x 38],</w>
5a 4],</w>
add_eax _edx,</w>
mov_rdi _rsi,</w>
]_xmm 2,</w>
mov_rax_qword_ptr_[rsp+0x 30],</w>
and _rax
9 c],</w>
lea_rsi_[rip+0x a
di ]
+ 8]_rax,</w>
_0xffff 870
je_0x1 9,</w>
mov_qword_ptr_[rsp ]_0,</w>
mov_esi _ebp,</w>
r or
mov_r8d _1,</w>
mov_edx _0x5
- 4],</w>
*4 +0x
add_rbx _1,</w>
mov_rax_qword_ptr_[rbp-0x 1
movzx_ecx _word_ptr_[r
p al
pal i
pali g
palig n
palign r
lea_rax _[rax
cx ,</w>
movzx_eax_byte_ptr_[r bp-0x
and _esi
_ sil,</w>
mov_qword_ptr_[rbp- 8]_rdi,</w>
_0x4 00,</w>
a b,</w>
mov_qword_ptr_[rsp+0x3 0]_rax,</w>
+rdx *4],</w>
mov_esi _0x
jne_ 7,</w>
mov_qword_ptr_[r bx+
_ dil,</w>
c] _edx,</w>
add_rax _qword_ptr_[r
bp +r
mov_dword_ptr_[rsp ]
jmp _0x7
mov_eax_dword_ptr_[rsp+0x c],</w>
cmp_eax _0x1
mov_edx_dword_ptr_[r ip+0x2
_0x8 0
call_0x e
mov_rbx_qword_ptr_[r ip+0x2
movdqu _xmm0_xmmword_ptr_[r
mov_rsi_qword_ptr_[r sp],</w>
mov_qword_ptr_[rbx ]_rax,</w>
lea_rsi_[rip+0x 7
mov_r12d _dword_ptr_[r
_qword_ptr_[rsp+0x 38],</w>
3 4]
cmp_rax _-1,</w>
bx +4],</w>
lea_rdi_[rip+0x 2
lea_rsi_[rip+0x 3
a 5,</w>
cx +r
test_byte_ptr_[r ax+0x1
mov_edx _0xa,</w>
mov_rsi_qword_ptr_[rsp+0x 20],</w>
mov_eax _0x4
mov_edi _0xa,</w>
mov_r9 _rax,</w>
test_ ah
mov_esi _0x6
mov_esi _ebx,</w>
lea_r13 _[rsp+0x
call_0xffffffffff e
mov_rdx_qword_ptr_[r sp+0x18],</w>
je_0xffffffffffff fb
lea_rsi_[rip+0x 5
9 4],</w>
mov_qword_ptr_[rbp-0x 6
mov_rax_qword_ptr_[r 15+0x
lea_rdi_[rax -0x18],</w>
mov_dword_ptr_[r 12
mov_dword_ptr_[r dx
]_ 5,</w>
s k
mov m
movm sk
7 c],</w>
mov_byte_ptr_[r sp+0x1
lea_rax_[rip+0x 2
mov_dword_ptr_[r ax]_0,</w>
cx +0x1
p movmsk
pmovmsk b
c k
* 2],</w>
lea_rsi_[rip+0x 6
1 8]_0,</w>
a 4,</w>
2 +
mov_edx_0x4 0
mov_qword_ptr_[rsp+ 8]_0,</w>
mov_r13 _rdx,</w>
a 1,</w>
p or
_r8 b,</w>
movzx _ebx
lea _r10
mov_ebp _dword_ptr_[r
je_0x1 e,</w>
mov_ecx_dword_ptr_[r bp-0x
c ]_1,</w>
8 4],</w>
cmp_edx _1,</w>
call_0x 9
sub_rsp _0x38,</w>
cmp_r 8d
a c,</w>
sub_rsp _0x30,</w>
_0xfffffff e,</w>
mov_rax_qword_ptr_[rbp-0x 50],</w>
q _qword_ptr_[r
a 3,</w>
test _bl
di +0x18],</w>
pop _rax,</w>
mov_rcx_qword_ptr_[r ax],</w>
mov _eax_eax,</w>
mov_rdx_qword_ptr_[r sp+0x10],</w>
jne_0x1 0,</w>
mov_qword_ptr_[rsp+0x a
mov_qword_ptr_[r 15+0x
mov_dword_ptr_[rsp+0x1 0]
st o
a a,</w>
mov_rsi _rdi,</w>
_0x1 00,</w>
2 8]_rax,</w>
13 +0x10],</w>
a d,</w>
si +0x10],</w>
mov_edi _0,</w>
_r12 b,</w>
add_rax _0x10,</w>
lea_ecx _[r
mov_edx _0x6
pop _rsi,</w>
jne_0x b,</w>
a 6,</w>
lea_r15 _[r
jne_0x1 1,</w>
14 ]
mov_qword_ptr_[rsp+0x2 0]
rep_ sto
je_0x2 0,</w>
mov_dword_ptr_[rsp+0x 20]
12 +r
mov_rdx_qword_ptr_[r sp],</w>
shl_rdx _3,</w>
ja _0x
mov_qword_ptr_[rbp-0x 20]
mov_rdx _rsp,</w>
call_0xffffffffffffe d
je_0x1 f,</w>
a f,</w>
jne_0x 12
mov_r9d _dword_ptr_[rsp+0x
_0x2 e,</w>
mov_rax_qword_ptr_[rbp-0x 2
bp l,</w>
add_rax _rcx,</w>
8 +8],</w>
mov_rax_qword_ptr_[rax+0x 38],</w>
bp+0x 18],</w>
jne_0x d,</w>
mov_dword_ptr_[rsp+0x c]_eax,</w>
2 ]_0,</w>
a e,</w>
jne_0x a,</w>
a 9,</w>
cmp_eax _dword_ptr_[rbp-0x
10 _xmm
mov_rax_qword_ptr_[r 14+0x
mov_qword_ptr_[r ax]_0,</w>
a 2,</w>
movzx_edi _byte_ptr_[r
add _ebp
3 0]
4 0]_0,</w>
mov_dword_ptr_[rsp+ 4]
a 7,</w>
]_xmm 4,</w>
shl_rax _3,</w>
call_0xfffffffffffe 0
push _qword_ptr_[r
call_0xffffffffffff dd
8 c],</w>
test _r10d_r10d,</w>
movdqu _xmmword_ptr_[r
jne_0x e,</w>
mov_edx _ebx,</w>
mov_rdi_qword_ptr_[r bp],</w>
mov_rcx _r14,</w>
p d
mov_ebx _1,</w>
mov_rax_qword_ptr_[rbp-0x 60],</w>
di ]_rax,</w>
_0x1 4,</w>
movsd _qword_ptr_[r
15 +
call_0xffffffffffffe c
lea_rdx_[rax *8],</w>
cmp_rax _qword_ptr_[r
lea_ecx _[rdx
sar _eax
ffff fff,</w>
cmp_edx _eax,</w>
test_r8 _r8,</w>
cmp_rax _rdx,</w>
mov_rax_qword_ptr_[rbp-0x 10
je_0x2 2,</w>
mov_dword_ptr_[r di+0x
call_0xffffffffffffe 0
mov_qword_ptr_[rsp+0x1 0]_0,</w>
c 9
test _eax
lea_r12 _[rsp+0x
mov_rax_qword_ptr_[r 12+0x
+rax* 2],</w>
movzx _r9d
4 3
mov_qword_ptr_[rsp+0x1 8]_0,</w>
call_0xffffffffffff 3
2 ]
ja _0x2
c] _esi,</w>
cmp_qword_ptr_[r bp-
mov_r12d _1,</w>
mov_rdx_qword_ptr_[rbp-0x 18],</w>
14 +0x10],</w>
jne_0x 13
]_xmm 3,</w>
mov_dword_ptr_[r bp
jg _0xffffffffffff
mov_qword_ptr_[r dx+0x
a b
je_0x2 1,</w>
lea_rax_[r dx
cmp_ ax
mov_rdi_qword_ptr_[r bx+8],</w>
mov_rdi_qword_ptr_[rsp+0x 30],</w>
mov_rax_qword_ptr_[rbp-0x 78],</w>
o ck
l ock
10 10
o m
lea_rcx_[r bp-0x
call_0xffffffffffffe b
je_0x2 5,</w>
seta _al,</w>
di ]_0,</w>
c om
jl e_0xffffffffffffff
mov_rax_qword_ptr_[rbp-0x b8],</w>
2 8]
ax+0x 30],</w>
mov_edi _6,</w>
add_rsp _0x30,</w>
add_ebx _1,</w>
a d
jne_0xffffffffffff fa
mov_rax_qword_ptr_[rsp+0x 40],</w>
mov_edx _ebp,</w>
mov_edx_dword_ptr_[r ax],</w>
cmp_byte_ptr_[r bp-0x
a c
di +r
shr _ecx
mov_edx _4,</w>
bp l
mov_rdi _r8,</w>
mov_dword_ptr_[r 15+0x
lea_rbp _[rsp+0x
- 2],</w>
com i
mov_qword_ptr_[rsp+0x4 0]_0,</w>
mov_esi _r12d,</w>
4] _ecx,</w>
0 8,</w>
bx ]_0,</w>
call_0xfffffffffff 6
mov_qword_ptr_[rsp+0x2 0]_0,</w>
_0x ff,</w>
1 9],</w>
mov_rcx_qword_ptr_[r ip+0x20
movaps_xmmword_ptr_[r bp-0x
cmp _r8
mov_dword_ptr_[rsp+ 8]_eax,</w>
mov_qword_ptr_[r si
dx +0x10],</w>
cmp_dword_ptr_[r ip+0x2
5 0]_0,</w>
call_0xffffffffffffe e
4] _edi,</w>
]_xmm 5,</w>
je_ 6,</w>
9 +0x
je_0x2 a,</w>
mov_dword_ptr_[r si
mov_rax _rsi,</w>
add _esi
5 9
xor _rdx
0 1,</w>
mov_rax _rbp,</w>
mov_qword_ptr_[rsp+0x4 8]_rax,</w>
je_0x2 8,</w>
13 +r
je_0xffffffffffff fa
add_rdx _1,</w>
cmp_byte_ptr_[r sp+0x
mov_edx _r13d,</w>
s q_qword_ptr_[r
sq_qword_ptr_[r di]_rax,</w>
_r13 b,</w>
rep_sto sq_qword_ptr_[rdi]_rax,</w>
mov_rsi_qword_ptr_[rsp+0x 28],</w>
jne_0x 14
mov_r10d _dword_ptr_[rsp+0x
_qword_ptr_[rsp+0x 40],</w>
mov_eax _0x1
8] _rbp,</w>
mov_edx_dword_ptr_[r bx+0x
lea_esi _[r
cmp_eax _3,</w>
mov_dword_ptr_[rsp+0x 6
20 0],</w>
14 +r
sub _ebx
lea_rbx _[rsp+0x
mov_rax_qword_ptr_[r sp+0x1
_xmm1_xmm 0,</w>
l dq
cmp_eax _dword_ptr_[r
sub_edx _eax,</w>
je_0x3 9,</w>
s s
mov_ecx _0,</w>
je_0x2 3,</w>
sub_rsp _0x1
+rdx *8],</w>
mov_qword_ptr_[rbp-0x 7
or _ecx
test_cl _cl,</w>
14 ]_0,</w>
jmp_0xfffffffffffff dd
mov_r13d _dword_ptr_[r
_d word_ptr_fs:
6 9
test_ sil
cmp_eax _0xffff86
15 +0x18],</w>
_xmm 4
0] _rbx,</w>
lea _r11
lea_rdx_[r ip-0x
c e
mov_qword_ptr_[rsp+0x5 8]_rax,</w>
lea_rsi_[rip+0x b
cmp_qword_ptr_[rbp- 8]_0,</w>
_0xfffffffffffffff 0,</w>
mov_rax_qword_ptr_[rbp-0x 4
]_ sil,</w>
mov_qword_ptr_[r 13+0x
8] _r12,</w>
lea_r8 _[rsp+0x
lea_rsi_[rip+0x 10
mov_eax _r13d,</w>
mov_qword_ptr_[rsp+0x b
sete _dl,</w>
imul _rax
_0x8 8,</w>
mov_eax_dword_ptr_[r di+0x
mov_eax_dword_ptr_[r bp-4],</w>
_ x
mov_rdi_qword_ptr_[rsp+0x 38],</w>
lea_rcx_[r dx
call_0xffffffffffff 2
15 +r
jne_0x1 2,</w>
lea_rsi_[rip+0x d
add_rax _8,</w>
mov_r14d _dword_ptr_[r
_0x2 00,</w>
ax *8+0x
14 +
mov_rsi_qword_ptr_[r bx],</w>
je_0x2 4,</w>
_qword_ptr_[r sp+8],</w>
movdqa _xmm1_xmmword_ptr_[r
je_0x2 9,</w>
cmp_qword_ptr_[r ax+0x
je_0x2 6,</w>
lea_eax_[r dx
mov_eax_dword_ptr_[r ax+0x1
je_0x2 d,</w>
lea_r14 _[rsp+0x
0 a,</w>
mov_rax_qword_ptr_[r 13+0x
mov_rax_qword_ptr_[r bx+8],</w>
mov_rdi_qword_ptr_[rsp+0x 40],</w>
add _rax_rax,</w>
20 ]_1,</w>
jne_0x 15
3 0]_rax,</w>
]_ cx,</w>
8] _r10,</w>
mov_eax_dword_ptr_[rbp-0x 14],</w>
lea_rsi_[rip+0x 8
_0x1 1,</w>
call_0xfffffffffff dd
mov_rax_qword_ptr_[rbp-0x 88],</w>
mov_edi_dword_ptr_[r ip+0x2
mov_ecx _r12d,</w>
]_xmm 6,</w>
n e_
lea_rsi_[rip+0x 14
add _r10
_0x5 c,</w>
0 2,</w>
0] _rdi,</w>
mov_dword_ptr_[rsp+0x1 8]
movsx_eax _al,</w>
_al _0,</w>
movzx_eax _ax,</w>
12 +0x18],</w>
shr _rdx
sbb _al_0,</w>
mov_r14 _rdi,</w>
mov_rdx_qword_ptr_[r bp+0x
mov_esi _4,</w>
test _r11d_r11d,</w>
test_byte_ptr_[r bx+0x
je_0xffffffffffff fff
mov_qword_ptr_[rsp+ 8]_rdx,</w>
call_0xffffffffffffd a
mov_rsi_qword_ptr_[r bx+0x
call_0xffffffffffffe f
mov_rdi_qword_ptr_[r di+0x
mov_qword_ptr_[rbp-0x20] _rsi,</w>
jne_0x1 5,</w>
2 1
mov_dword_ptr_[rsp+0x 7
mov_rdx_qword_ptr_[r bp-8],</w>
si +r
a e
0 5,</w>
mov_rdx_qword_ptr_[r ax+8],</w>
lea_r9 _[rsp+0x
cmp_qword_ptr_[r bp+0x
_0x7 0,</w>
mov_esi_dword_ptr_[r bp-0x
mov_byte_ptr_[r ax+
] _rcx,</w>
4 9
cx +8],</w>
mov_qword_ptr_[rbp-0x 8
13 +
sub _esi
mov_edi _r12d,</w>
_0x8 00,</w>
4 8]_0,</w>
5 3
mov_rdx_qword_ptr_[rsp+0x 20],</w>
u comi
]_xmm 7,</w>
cmp_qword_ptr_[r sp+0x1
mov_qword_ptr_[rbp-0x2 0]_rax,</w>
mov_edi _4,</w>
mov_byte_ptr_[r cx
-0x 10],</w>
movsd _xmm1
0 4,</w>
_0xfffffffffffffff a,</w>
je_0x2 7,</w>
7 9
and _edi
12 +
0 3,</w>
0 6,</w>
mov_rdx _rdi,</w>
mov_esi _3,</w>
mov_rdx_qword_ptr_[rsp+0x 28],</w>
mov_ecx _2,</w>
mov_eax_dword_ptr_[r ax+4],</w>
mov_ebp _1,</w>
mov_rdx_qword_ptr_[r ip+0x
_0x3 d,</w>
mov_rax_qword_ptr_[rsp+0x 48],</w>
mov_qword_ptr_[rdx ]_rax,</w>
cmp_eax _0x2
d e
0 d,</w>
jne_0x1 6,</w>
0 f,</w>
0 e,</w>
mov_rdx_qword_ptr_[r ax+0x10],</w>
jne_0x f,</w>
bp +1],</w>
mov_esi _ecx,</w>
mov_rax_qword_ptr_[r bx+0x10],</w>
jmp _0x8
_xmm 6,</w>
cmp_byte_ptr_[r dx
mov_edx _ecx,</w>
0 9,</w>
0 c,</w>
_ ax
movsxd _rbx
lea_rdi_[rip+0x 20
cmp_rax _1,</w>
call_0xfffffffffffe 7
mov_qword_ptr_[r 14+0x
call_0x f
mov_qword_ptr_[rbp-0x2 8]_rax,</w>
sd _xmm0_xmm1,</w>
mov_qword_ptr_[rsp+0x c
0000 000,</w>
movdqa _xmm0_xmmword_ptr_[r
2 1],</w>
jl e_0xffffffffffff
mov_byte_ptr_[r sp+
0 b,</w>
mov_rax_qword_ptr_[r 12],</w>
_ -
mov_ecx _0x40
3 8]_rax,</w>
_qword_ptr_[rsp+0x 48],</w>
_eax _edx,</w>
mov_rcx_qword_ptr_[r sp+0x10],</w>
b 4
_r9 b,</w>
sar _rax
and_eax _0xfffffff
ax+0x 40],</w>
0 8],</w>
mov_r8_qword_ptr_[r sp+8],</w>
-0x 30],</w>
_r14 b,</w>
a f
b f
cmp_byte_ptr_[r ax]_0,</w>
mov_r8 _rbx,</w>
movabs _rdx
_byte_ptr_[r sp+0x
lea_rbx _[rip+0x
6 0]_0,</w>
cmp_dword_ptr_[r ip+0x
add_rsp _0x1
mov_rax_qword_ptr_[rax+0x 30],</w>
mov_rcx_qword_ptr_[rsp+0x 28],</w>
mov_rcx _r15,</w>
xor_rdx _qword_ptr_fs:[0x28],</w>
10 +0x
cvtsi2 sd_xmm0
add_rsp _0x48,</w>
lea_rcx _[rax
0 7,</w>
add _r12d
_0xffff ,</w>
00 000,</w>
call_0xffffffffffffd 0
mov_rcx_qword_ptr_[r ip+0x
sub_rax _rdx,</w>
sub_rax _1,</w>
24 ]_0,</w>
mov_qword_ptr_[rsp+8] _rsi,</w>
mov_eax _0x6
mov_dword_ptr_[r 12+0x
mov_qword_ptr_[rsp+0x4 8]_0,</w>
6 3
mov_dword_ptr_[rbp-0x 1
mov_edx _8,</w>
mov_rdi_qword_ptr_[r bx+0x10],</w>
movzx_esi _word_ptr_[r
add _r8
14 +0x18],</w>
mov_eax _0x16,</w>
mov_qword_ptr_[r 12+0x1
lea_r12 _[rip+0x
xor_r si
mov_edi_dword_ptr_[r ip+0x
_ bpl,</w>
jne_0x1 4,</w>
call_0xfffffffffffff 7
lea_rsi_[rip+0x c
mov_rax_qword_ptr_[r 13],</w>
movsx _edx
bx ]
mov_ecx _r13d,</w>
1d ],</w>
je_0x2 c,</w>
movzx _ebp
mov_eax_dword_ptr_[r ax+8],</w>
mov_rax_qword_ptr_[rbp-0x a8],</w>
mov_rax_qword_ptr_[rax+0x 28],</w>
mov_r15d _dword_ptr_[r
mov_dword_ptr_[r bx+
lea_edi _[r
jg _0x1
1 6],</w>
test_byte_ptr_[r ax+0x
mov_qword_ptr_[rsp+0x2 8]_0,</w>
mov_rdi_qword_ptr_[r di],</w>
je_0x3 1,</w>
mov_rdx_qword_ptr_[rbp-0x 10],</w>
mov_rdx_qword_ptr_[rbp-0x 28],</w>
mov_dword_ptr_[r cx
24 ]_eax,</w>
mov_esi _r13d,</w>
mov_rax _rdi,</w>
mov_qword_ptr_[rax+ 8]_rdx,</w>
2 2],</w>
je_0x3 0,</w>
mov_qword_ptr_[rsp+ 8]_rcx,</w>
mov_dword_ptr_[r dx+0x
8] _r13,</w>
_0x6 4,</w>
mov_r8 _rbp,</w>
_0x8 000,</w>
2 9],</w>
2 20],</w>
ea ],</w>
1 8]_rax,</w>
14 ]_eax,</w>
mov_byte_ptr_[r ax+0x
mov_qword_ptr_[rsp+0x4 0]_rax,</w>
28 ]_8,</w>
mov_dword_ptr_[rax] _edx,</w>
_0x6 0,</w>
je_0x2 e,</w>
jn e_8,</w>
cmp_r 9d
mov_qword_ptr_[rbp-0x 9
mov_r11d _dword_ptr_[rsp+0x
jne_0x1 8,</w>
mov_qword_ptr_[rbp-0x2 8]_rdi,</w>
lea_rax_[rip+0x 20
28 ]_1,</w>
1 a],</w>
xor_eax _1,</w>
_xmm 5
5 8]_0,</w>
0 0],</w>
c] _ecx,</w>
_0xf 000,</w>
_d h
si +0x18],</w>
lea_rsi_[rip+0x 13
mov_rsi_qword_ptr_[r ip+0x
mov_ecx _ebx,</w>
mov_rcx_qword_ptr_[r bp-8],</w>
_rdx _rax,</w>
c h
and_edx _1,</w>
mov_qword_ptr_[rsp+0x d
_dword_ptr_fs: [r
_0x7 f2
mov_rax_qword_ptr_[rbp-0x 70],</w>
mov_rdx_qword_ptr_[r ip+0x20
je_0x3 2,</w>
mov_r14 _rsi,</w>
mov_qword_ptr_[r ax
mov_eax _r14d,</w>
mov_rsi_qword_ptr_[rsp+0x 30],</w>
f 8
2c ]_eax,</w>
mov_dword_ptr_[r 13+0x
_0x7f2 bb
_rax _rdx,</w>
8d ],</w>
bp+0x 20],</w>
dx +rax],</w>
mov_eax _r15d,</w>
shl _edx
mov_qword_ptr_[rsp+0x3 0]_0,</w>
9d ],</w>
mov_rbx_qword_ptr_[r ip+0x20
test_byte_ptr_[r bp+0x
call_0xffffffffff ee
sub_rsp _0x48,</w>
sub _rbx
y mm
mov_r9 _rbx,</w>
mov_qword_ptr_[rax+0x 20]
js _0x
mov_r8d _0x4
_xmm 4,</w>
call_0xffffffffffffd c
mova pd
mov_r13d _1,</w>
cmp_dword_ptr_[r sp+0x1
xor _r10d_r10d,</w>
je_0x2 b,</w>
fe ],</w>
test_r 9
lea_r15 _[rsp+0x
neg _eax,</w>
ff ],</w>
8] _esi,</w>
mov_r8 _r12,</w>
mov_rdx_qword_ptr_[rbp-0x 20],</w>
xor_rsi _qword_ptr_fs:[0x28],</w>
mov_qword_ptr_[rbp-0x c
20] _eax,</w>
mov_eax _esi,</w>
si+0x 20],</w>
13 +0x18],</w>
mov_dword_ptr_[rbp-0x 2
sub _rdi
imul _eax
]_ 6,</w>
ja _0x3
mov_eax_dword_ptr_[r ax+0x10],</w>
lea_rsi_[r sp+0x10],</w>
3 1],</w>
or _byte_ptr_[r
shl _rsi
e 7
sp +r
jne_0x1 7,</w>
call_0xfffffffffffff 8
je_0x2 f,</w>
c f
8 +0x1
lea_r13 _[rip+0x
mov_ecx _4,</w>
and _dword_ptr_[r
_[rax -1],</w>
mov_qword_ptr_[rsp+0x3 0]
push _rcx,</w>
2 a],</w>
_r15 b,</w>
sp+0x10 0],</w>
cmp_al _0x2
mov_edx_dword_ptr_[r ip+0x
8 9
sub_rsp _0x40,</w>
_0xffff870 3,</w>
1 e],</w>
sub _dword_ptr_[r
test_r9 _r9,</w>
mov_qword_ptr_[rsp+8] _r8,</w>
30 ]_1,</w>
e 5
call_0xffffffffffffc a
di+0x 20],</w>
mov_ebp _esi,</w>
mov_r9d _1,</w>
mov_qword_ptr_[rax+0x1 0]_rdx,</w>
cx +1],</w>
mov_rsi _r8,</w>
mov_rax_qword_ptr_[rsp+0x 50],</w>
mov_rax_qword_ptr_[rbp-0x 80],</w>
jne_0x1 b,</w>
lea_r10 _[r
_xmm1_xmm 1,</w>
mov_dword_ptr_[rsp ]_eax,</w>
mov_esi _0x3
38 ]_1,</w>
mov_rdi_qword_ptr_[r ax+8],</w>
lea_rdx_[rip+0x 2
e 6
movzx_eax_byte_ptr_[r sp+0x
+rax +1],</w>
mov_eax_dword_ptr_[r 15+0x
test_al _1,</w>
mov_eax _2,</w>
mov_r8 _r13,</w>
fd ],</w>
] _rbx,</w>
58 ]_1,</w>
1 7],</w>
_[rax +r
mov_rdi_qword_ptr_[r 12+0x
f 6
a 4],</w>
mov_byte_ptr_[r bx+0x
mov_eax _r8d,</w>
1 b],</w>
mov_esi _0x20,</w>
lea_rbp _[rip+0x
cmp_dword_ptr_[r bx+0x
_0xa 8,</w>
movsx _esi
cmp_ecx _1,</w>
34 ]_4,</w>
mov_rdi _r9,</w>
lea_rdi_[rip+0x 3
8 ]_xmm0,</w>
+ 8]_0,</w>
3 9],</w>
mov_edx _0x7
xor _rdi
call_0x1 a
lea_rdi _[rax+1],</w>
mov_edx _0x10,</w>
movzx _r12d
dx +0x18],</w>
_qword_ptr_[rsp+0x 50],</w>
cvt t
2 si
mov_rax_qword_ptr_[rbp-0x f0],</w>
lea_rsi_[rip+0x 1
movzx _r13d
_0x1 a,</w>
pmovmskb _edx
mov_qword_ptr_[rbp ]_rax,</w>
movzx_r8d _byte_ptr_[r
lea_rdi_[rip+0x 4
jl _0xffffffffffffff
call_0xfffffffffffd 0
b 7
1 f],</w>
add _r13d
cmp_byte_ptr_[r ax+
call_0xfffffffffffd a
mov_r14 _rdx,</w>
movzx_eax_byte_ptr_[r ax+0x
mov_edx _r14d,</w>
lock _x
0] _ecx,</w>
mov_ecx _0x80,</w>
pop _rdi,</w>
call_0xffffffffffffd b
2c ]_0,</w>
jmp _6,</w>
bb ],</w>
add_rsp _0x58,</w>
lock_x add_dword_ptr_[r
dd ],</w>
js _0x2
- 1]
mov_edi_0x4 d
call_0x2 0
mov_edx_dword_ptr_[r bp+0x
8] _r11,</w>
and _r8d
e 4
bx+0x 30],</w>
_0x2 000,</w>
mov_byte_ptr_[r ax
call_0xffffffffffffc 0
add_ebp _1,</w>
jne_0x1 9,</w>
call_0xfffffffffffe 8
mov_edx _3,</w>
mov_eax _edi,</w>
mov_edx _0x8
call_0xffffffffffff bb
mov_rbx_qword_ptr_[r bx],</w>
add _edi
add_rbx _8,</w>
lea_rax_[rsp+0x 20],</w>
je_0x3 8,</w>
jmp_0xfffffffffffff 0
mov_edx _0xffffffff,</w>
3 e],</w>
lea_rsi_[rip+0x 12
mov_qword_ptr_[rbp-0x a
je_0x3 5,</w>
mov_rax_qword_ptr_[rsp+0x 58],</w>
lea _ebx
ja e_0xffffffffffffff
f 5
lea_r 8d
8] _r14,</w>
je_0x3 3,</w>
c 7
2 6],</w>
c mova
_0x fff,</w>
lea_rsi_[r dx
mov_dword_ptr_[rsp+0x1 0]_eax,</w>
cmp_eax _4,</w>
shl_rax _5,</w>
e 8
2+ 1]
mov_ecx _ebp,</w>
mov_byte_ptr_[rax] _dl,</w>
call_0xfffffffffffe 6
xor _edx
7 0]_0,</w>
] _0x4
4 0]_rax,</w>
mov_rdx_qword_ptr_[r dx+0x
call_0xfffffffffff 5
+rax ]_0,</w>
cmp _r9
_byte_ptr_[r di],</w>
je_0x3 7,</w>
sub_rsp _0x58,</w>
mov_rax_qword_ptr_[rbp-0x c8],</w>
b 8
call_0xfffffffffffff 6
12 +1],</w>
mov_rax _r13,</w>
3 2],</w>
cc cc
di+0x 30],</w>
jb _0xffffffffffff
mov_r14d _1,</w>
je_0x3 4,</w>
jne_0x1 a,</w>
mov_qword_ptr_[r 15
sub _r10
_0x1 2,</w>
lea_rax_[r sp+0x1
mov_esi _0xffffffff,</w>
mov_qword_ptr_[rax+0x1 8]_rdx,</w>
1 ]_al,</w>
test_bl _bl,</w>
mov_eax_dword_ptr_[r sp+8],</w>
je_0x3 6,</w>
mov_dword_ptr_[r 13
mov_rcx_qword_ptr_[r sp],</w>
add_rsp _0x68,</w>
mov_byte_ptr_[r ip+0x2
mov_qword_ptr_[r dx+0x1
mov_r15 _rdi,</w>
]_ dil,</w>
movzx _r10d
add _r14d
_ ah
cmp_dword_ptr_[r bp-
cmp_qword_ptr_[r ip+0x2
c 6
2 7],</w>
mov_qword_ptr_[r di+0x1
dx ]_eax,</w>
_ ymm
je_ 5,</w>
9 ]_0,</w>
mov_rdi_qword_ptr_[rsp+0x 48],</w>
call_0xffffffffffffd e
mov_eax_dword_ptr_[rbp-0x 1c],</w>
2 5],</w>
4 1],</w>
3 a],</w>
mov_rax_qword_ptr_[r di+8],</w>
and _ebx
mov_rdx_qword_ptr_[rsp+0x 30],</w>
mov_qword_ptr_[r12 ]_rax,</w>
5 8]_rax,</w>
di +1],</w>
cmp_rbx _rax,</w>
sd _xmm1
cmp_dword_ptr_[r bp+0x
call_0xfffffffffff 0
mov_edi _r13d,</w>
1 0]
mov_esi _0x7
sub_rsp _0x68,</w>
mov_qword_ptr_[rbp-0x b
test_ bpl
c 8]_0,</w>
mov_r12d _edx,</w>
or_eax _edx,</w>
movdqa_xmm1_xmmword_ptr_[r si
si +4],</w>
mov_edi _0x20,</w>
mov_rdi_qword_ptr_[r 12],</w>
push _qword_ptr_[rbp-0x
_ dx,</w>
cmp_ sil
bp +4],</w>
jmp_0xfffffffffffff 8
je_0x3 c,</w>
mov_qword_ptr_[rbp-0x3 8]_rax,</w>
mov_rdx_qword_ptr_[rsp+0x 38],</w>
1 0]_rax,</w>
sd 2si
cvtt sd2si
+rdx* 2],</w>
lea_rsi_[r bp-0x
_qword_ptr_[rsp+0x 58],</w>
cmp_dword_ptr_[r ip+0x20
je_0x3 d,</w>
mov_rsi_qword_ptr_[rsp+0x 38],</w>
mov_eax_dword_ptr_[r 12+0x
2 e],</w>
mov_qword_ptr_[rsp+0x6 8]_rax,</w>
mov_qword_ptr_[rbx+ 8]_rax,</w>
jne_ 6,</w>
mov_dword_ptr_[rbp-0x 47
_0x1 3,</w>
]_ 7,</w>
14 +1],</w>
jns _0xffffffffffffff
mov_qword_ptr_[rsp+0x5 0]_0,</w>
mov_rax_qword_ptr_[r bx+0x1
mov_rax _-0x
+rcx *
a 7
mov_qword_ptr_[rsp+ 8]_rdi,</w>
movzx_edx_byte_ptr_[r ax],</w>
pand_xmm 8_xmm
call_0xfffffffffffff 5
movdqa_xmm 3
mov_r9d _eax,</w>
call_0xfffffffffffd c
p sub
12 0],</w>
mov_rax_qword_ptr_[r bx+0x18],</w>
mov_qword_ptr_[rbp-0x 10
mov_rax_qword_ptr_[r ax+0x1
dx +4],</w>
lea_rsi_[r ip-0x
cmp_dword_ptr_[r ax+0x
3 f],</w>
movsx _edi
mov_rdi_qword_ptr_[rsp+0x 50],</w>
mov_rdx _r8,</w>
+rax* 4
psub b
mov_esi _r14d,</w>
lea_r14 _[rip+0x
call_0xfffffffffffe 9
mov_r9d _4,</w>
i div
movsd_xmm0 _qword_ptr_[r
cmov l
b 6
test_dil _dil,</w>
cmp_eax _0x6
aa aa
mov_ecx _8,</w>
ax+0x 70],</w>
mov_qword_ptr_[r 15+0x1
mov_dword_ptr_[rsp+0x 8
b 4],</w>
shl_rdx _4,</w>
mov_ecx_dword_ptr_[r bx+0x
mov_rax_qword_ptr_[rbp-0x d8],</w>
shl _rcx
2 f],</w>
mov_rdx_qword_ptr_[r bx],</w>
mov_r8 _r14,</w>
] _0x20,</w>
mov_ebx _dword_ptr_[rsp+0x
sub_eax _edx,</w>
call_0xfffffffffffe 4
call_0xffffffffff ed
mov_r12d _esi,</w>
je_0x3 e,</w>
test_sil _sil,</w>
0000 00,</w>
lea_rdx_[rsp+0x 30],</w>
3 5],</w>
2 d],</w>
d f
mov_r12 _rcx,</w>
3 ]_0,</w>
a c],</w>
_r10 b,</w>
mov_rsi_qword_ptr_[r bp+0x
jne_0xffffffffffffffe d,</w>
xor_rdi _qword_ptr_fs:[0x28],</w>
je_0x4 2,</w>
a 8
13 +1],</w>
mov_qword_ptr_[rdi -0x
mov_rax_qword_ptr_[rax+0x 40],</w>
mov_r10 d_eax,</w>
_0x2 7,</w>
movdqa _xmm2_xmmword_ptr_[r
mov_ecx_dword_ptr_[r bp+0x
ax +1],</w>
0] _rbp,</w>
_0x1 c,</w>
2 b],</w>
mov_dword_ptr_[rax -
sar _edx
mov_rdx_qword_ptr_[r ax+0x18],</w>
sub _edi
cmp_eax _0x4
movaps_xmmword_ptr_[rsp+0x 70
or _qword_ptr_[r
si +1],</w>
mov_dword_ptr_[r 14+0x
mov_edx _esi,</w>
e 4],</w>
8] _r15,</w>
call_0xfffffffffffd b
4 8]_rax,</w>
jmp_0xfffffffffffff 7
mov_rcx_qword_ptr_[rsp+0x 20],</w>
50 ]_xmm0,</w>
mov_r15d _1,</w>
_xmm0_xmm 2,</w>
mov_qword_ptr_[rbp-0x1 0]_rsi,</w>
c 8
c 4],</w>
di +4],</w>
1 00
mov_esi _0xa,</w>
d 7
ax -8],</w>
_0x2 4,</w>
mov_ecx _0x5
_xmm 6
20 8],</w>
mov_qword_ptr_[rsp+0x e
2 3],</w>
mov_qword_ptr_[rbp-0x 47
15+0x 20],</w>
test_al _2,</w>
movzx_edi _word_ptr_[r
3 6],</w>
f 4
mov_byte_ptr_[r ax+0x1
_0x3 c,</w>
cmp_rdi _0x6
test_r12 b
] _ecx,</w>
mov_r13 _rcx,</w>
add_rdx _rcx,</w>
b t
mov_ecx _r14d,</w>
cx -0x
call_0xffffffffffffc c
jne_0x1 e,</w>
9 1],</w>
shl_rax _2,</w>
test_byte_ptr_[r di+0x1
+ 3],</w>
call_0x 37
1c 0],</w>
and_eax _0xf000,</w>
mov_qword_ptr_[rbp-0x3 0]_rax,</w>
call_0xffffffffffffd f
movaps_xmmword_ptr_[rsp+0x 60
11 +0x
movaps_xmmword_ptr_[rsp+0x 80
call_0xffffffffff ec
mov_qword_ptr_[rsp+0x5 0]_rax,</w>
mov_ecx_dword_ptr_[r ip+0x2
9 9],</w>
34 ]_eax,</w>
3 7],</w>
lea _r12d
jmp _9,</w>
mov_qword_ptr_[rax+0x 3
mov_rax_qword_ptr_[rbx+0x e0],</w>
ax+0x 38],</w>
34] _0x40,</w>
lea_rdx_[rip+0x 7
add_rbp _1,</w>
mov_rbx_qword_ptr_[r ax],</w>
c 4
mov_dword_ptr_[r si+0x
movaps_xmmword_ptr_[rsp+0x 90
lea_ecx_[rdx -1],</w>
lea_rdx_[r sp+0x10],</w>
xor _ecx
mov_eax_dword_ptr_[rbp-0x c],</w>
call_0x 3a
call_0x 34
movaps_xmmword_ptr_[rsp+0x a0
add_rax _0x20,</w>
mov_rsi_qword_ptr_[r 12],</w>
mov_qword_ptr_[r 14
je_0x4 5,</w>
5 9],</w>
call_0xffffffffffffc d
mov_qword_ptr_[rsp+0x3 8]_0,</w>
jb _0x1
mov_rax_qword_ptr_[r 15],</w>
je_0x3 a,</w>
c 0]_0,</w>
jne_0x 20
movsxd _rbp
mov_rdi_qword_ptr_[r bp+8],</w>
sub _r8
mov_qword_ptr_[rax+ 8]_0,</w>
mov_dword_ptr_[r 15
d 6
mov_rcx _-1,</w>
lea_rdi_[rip+0x a
8] _0x4
cmp_qword_ptr_[r ip+0x
pxor _xmm1_xmm1,</w>
movzx_eax_word_ptr_[r ax],</w>
mov_dword_ptr_[r dx+0x1
9 ]
mov_rax_qword_ptr_[r 14],</w>
movaps_xmmword_ptr_[rsp+0x b0
3 d],</w>
call_0xffffffffffffb a
sub _ebp
mov_qword_ptr_[rsp+0x1 0
mov_byte_ptr_[r bp
set ne_
_xmm1_xmm 2,</w>
mov_byte_ptr_[r si+
r ldq
ps rldq
call_0x 30
mov_r9 _rbp,</w>
mov_rbx_qword_ptr_[r bp-0x
movsx_eax _byte_ptr_[r
mov_esi _0x8
movsxd_rdi _edi,</w>
mov_eax_dword_ptr_[r bx],</w>
je_0x4 0,</w>
b c],</w>
cmp_qword_ptr_[rbp-0x 10]_0,</w>
mov_dword_ptr_[rbp-0x 4a
15 +1],</w>
cmp_rdi _rbx,</w>
ja _0x4
sbb _eax_eax,</w>
cmp_eax _edx,</w>
c c],</w>
bx+ 2],</w>
call_0x 3c
0] _r12,</w>
js _0xffffffffffffff
movzx _r14d
34 ]_0,</w>
+rcx *4],</w>
2 8]_rdx,</w>
mov_r13d _edx,</w>
jne_0x2 2,</w>
mov_rdx_qword_ptr_[rbp-0x 78],</w>
lea_rdi_[r bp-0x
jne_0x1 c,</w>
lea_rsi_[rip+0x 11
mov_dword_ptr_[r di+0x1
jmp_0x1 5,</w>
4] _0xffffffff,</w>
movzx_ebx _byte_ptr_[r
cmov g
mov_eax_dword_ptr_[r sp+0x18],</w>
mov_ebx _edi,</w>
call_0xffffffffffffc b
mov_rax _r8,</w>
jne_0xfffffffffffffff 1,</w>
movzx_edx _dl,</w>
bx+0x1 4],</w>
lea_rsi_[rip+0x e
test _r10
mov_qword_ptr_[rsp+0x3 8]_rcx,</w>
a 4
cmp_qword_ptr_[r sp+
add_edx _1,</w>
mov_rbx _rcx,</w>
13+0x 20],</w>
mov_rax_qword_ptr_[rbp+0x 10],</w>
d 4],</w>
call_0xffffffffffffb 0
lea_rdi_[r bx+0x
jne_0x1 d,</w>
x ch
movsxd_rcx _ecx,</w>
mov_eax_dword_ptr_[rbp-0x 24],</w>
jmp_0x e,</w>
call_0x 3b
5 1],</w>
6 1],</w>
3 3],</w>
movaps_xmmword_ptr_[rsp+0x c0
mov_dword_ptr_[rsp+0x1 8]_eax,</w>
di +rdx
call_0xfffffffffffd e
3 b],</w>
mov_eax_dword_ptr_[r sp+4],</w>
mov_esi_dword_ptr_[r ip+0x2
and _ebp
add _r9
lea_rdi_[r sp+0x10],</w>
jmp_0x c,</w>
je_0x3 b,</w>
jmp_0xffffffffffffff e
mov_ebx _esi,</w>
add_edx _eax,</w>
12+0x 20],</w>
jmp_0x1 2,</w>
mov_rsi_qword_ptr_[r bp],</w>
mov_rax_qword_ptr_[rsp+0x 60],</w>
call_0xfffffffffffe 5
_0x2 0
_0x fff
di+0x 28],</w>
]_ si,</w>
di ,</w>
cmp_byte_ptr_[r ip+0x2
add_r12d _1,</w>
_xmm 7
_r8 w,</w>
mov_rcx _rsi,</w>
mov_rdi_qword_ptr_[rsp+0x 58],</w>
_0x1 9,</w>
je_0x3 f,</w>
bx -1],</w>
d 8
cmp_byte_ptr_[r ax]
movaps_xmmword_ptr_[r di-0x
lea_rdi_[rip+0x 7
mov_qword_ptr_[rsp+0x f
lea_rdi_[rip+0x 6
je_0x4 d,</w>
_0xfffffffffffffff 8,</w>
add_rdx _qword_ptr_[r
je_0x5 d,</w>
or _esi
3c ]_eax,</w>
mov_rbp _rcx,</w>
mov_rax_qword_ptr_[rbp-0x 98],</w>
mov_qword_ptr_[rsp+0x6 0]_0,</w>
mov_rdx _-1,</w>
lea_rsi _[rax
sp -0x
mov_qword_ptr_[r si+0x
cmov be
_0x2 3,</w>
test_r13 b
pcmpeqb _xmm0_xmm1,</w>
test_byte_ptr_[r ip+0x2
lea_rdx_[rip+0x 3
lock_xadd_dword_ptr_[r dx]_eax,</w>
lea_rcx_[rip+0x 2
mov_rdi_qword_ptr_[r 14+0x
test_byte_ptr_[r sp+0x
mov_r9 _rdx,</w>
test_byte_ptr_[r ip+0x
jne_0xfffffffffffffff 0,</w>
cmp _r10
je_0x4 8,</w>
10 1],</w>
z mm
call_0x 38
mov_rax_qword_ptr_[rsp+0x 68],</w>
mov_ecx _0x6
sar _rdx
mov _dword_ptr_fs:[r
ja e_0xffffffffffff
8 +r
shl _rdi
cmp _bl
mov_dword_ptr_[rsp+0x2 8]
and_ecx _1,</w>
jne_0xffffffffffffffe e,</w>
8 ]_2,</w>
lea_rdx_[r di+0x10],</w>
_0x2 c,</w>
cmove _eax
mov_rdx_qword_ptr_[rsp+0x 40],</w>
mov_rax_qword_ptr_[r ax*8+0x
f 4],</w>
cx -1],</w>
cmp_dword_ptr_[r sp+
mov_rcx_qword_ptr_[r si],</w>
mov_eax_dword_ptr_[r ax+0x18],</w>
c] _0xffffffff,</w>
bswap _eax,</w>
add sd
mov_rsi_qword_ptr_[rsp+0x 40],</w>
mov_rcx _rsp,</w>
and_eax _0xffffff
movs s
mov_rcx _r8,</w>
a 6
mov_ecx_dword_ptr_[r ax],</w>
push _rsi,</w>
_0x ff
por _xmm1_xmm
and_eax _2,</w>
jmp_0x1 1,</w>
+rax* 8
u d2,</w>
mov_esi_0x4 00,</w>
mov_ecx_dword_ptr_[r ax+0x
mov_edx _r15d,</w>
5 0]
40 0],</w>
