<unk>
<pad>
<sos>
<eos>
xor_eax_eax,
test_eax_eax,
pop_rbx,
mov_rdi_rax,
ret,
pop_rbp,
push_rbp,
test_rax_rax,
push_rbx,
pop_r12,
mov_rdi_rbx,
mov_rdi_rbp,
push_r12,
ret
pop_r13,
push_r13,
mov_rax_qword_ptr_fs:[0x28],
pop_r14,
je_0x1@@
xor_edx_edx,
add_rsp_8,
sub_rsp_8,
push_r14,
mov_rdi_r12,
5,
7,
mov_esi_1,
mov_rax_qword_ptr_[rbp-8],
3,
b,
1,
mov_rax_qword_ptr_[rbp-0x18],
c,
2,
9,
d,
6,
je_0xffffffffffffff@@
e,
a,
jmp_0xfffffffffffffe@@
test_rdi_rdi,
endbr64,
mov_eax_0,
mov_rbp_rsp,
4,
xor_esi_esi,
pop_r15,
call_0xffffffffffffe@@
push_r15,
f,
mov_rbx_rdi,
4@@
8@@
6@@
b@@
jne_0xffffffffffffff@@
jne_0x@@
7@@
a@@
mov_rdx_rax,
9@@
3@@
e@@
mov_rdi_r13,
c@@
xor_ecx_ecx,
mov_rsi_rax,
5@@
9],
d@@
mov_rax_qword_ptr_[rax],
test_al_al,
test_rsi_rsi,
mov_rsi_rbp,
f@@
2@@
je_0x2@@
call_0xffffffffffffd@@
call_0x1@@
c],
xor_edi_edi,
jle_0x@@
jbe_0x@@
mov_edi_1,
jne_0x1@@
call_0xfffffffffffe@@
call_0xffffffffffffc@@
1],
mov_rax_qword_ptr_[rbp-0x28],
mov_rbp_rdi,
mov_eax_1,
mov_rbx_rax,
mov_rsi_rbx,
0@@
je_7,
mov_rdi_r14,
8,
leave,
mov_rsi_r12,
test_edx_edx,
6],
test_rdx_rdx,
mov_qword_ptr_[rsp+8]_rax,
add_rax_rdx,
a],
test_rbx_rbx,
5],
2],
mov_rdi_r15,
mov_edx_1,
12@@
lea_rdi_[rip+0x@@
3],
mov_edi_eax,
xor_r8d_r8d,
xor_rcx_qword_ptr_fs:[0x28],
add_rsp_0x18,
e],
10@@
mov_rax_qword_ptr_[rbp-0x10],
mov_rsi_rdx,
7],
call_0xfffffffffffd@@
f],
14@@
call_0x2@@
15@@
call_0xffffffffffffb@@
mov_rbp_rax,
lea_rdx_[rip+0x@@
20@@
call_0xfffffffffffffd@@
xor_rax_qword_ptr_fs:[0x28],
b],
movzx_eax_byte_ptr_[rax],
13@@
38],
4],
mov_qword_ptr_[rbp-8]_rax,
lea_rcx_[rip+0x@@
8]_0,
jne_0x2@@
cdqe,
]_0,
mov_edx_5,
mov_rax_qword_ptr_[rbp-0x38],
0,
mov_rax_qword_ptr_[rbp-0x20],
jne_0xfffffffffffffe@@
mov_edx_eax,
call_0xffffffffffffa@@
50],
19@@
48],
lea_rax_[r@@
mov_rsi_r13,
1a@@
40],
jmp_0x@@
18@@
lea_rdi_[r@@
30@@
d],
58],
mov_ebx_eax,
1c@@
16@@
11@@
lea_rax_[rip+0x@@
38@@
17@@
_4,
_2,
jmp_0x1@@
sub_rsp_0x18,
mov_qword_ptr_[rsp+0x18]_rax,
37@@
lea_rsi_[rip+0x@@
28@@
mov_r12_rax,
mov_eax_dword_ptr_[rax],
mov_rax_qword_ptr_[rip+0x2@@
40@@
24@@
]_1,
3c@@
30],
36@@
60],
mov_r12d_eax,
call_0xfffffffffffffc@@
_1,
22@@
je_0xfffffffffffffe@@
34@@
movzx_eax_byte_ptr_[r@@
sub_rsp_0x10,
cmp_dword_ptr_[rbp-0x@@
1d@@
2c@@
mov_esi_0x4@@
1b@@
3a@@
mov_rbp_rsi,
je_0x3@@
call_0xfffffffffffc@@
mov_eax_0xffffffff,
xor_ebx_ebx,
mov_qword_ptr_[rbx+0x@@
mov_rcx_qword_ptr_[r@@
call_0xffffffffffffff@@
28],
mov_rax_qword_ptr_[rsp+8],
27@@
00@@
mov_dword_ptr_[rbp-0x@@
mov_ecx_dword_ptr_[r@@
test_rbp_rbp,
3d@@
26@@
push_rax,
2a@@
lea_rdx_[r@@
50@@
mov_rbx_rsi,
3e@@
mov_dword_ptr_[rip+0x2@@
test_ecx_ecx,
mov_rdx_r12,
3b@@
mov_edx_dword_ptr_[r@@
call_0xfffffffffffffe@@
mov_edi_0x4@@
70],
lea_r8_[rip+0x@@
20],
8],
1e@@
mov_rsi_rcx,
5a@@
lea_rsi_[r@@
call_0xffffffffffff7@@
cmp_eax_1,
2b@@
mov_rcx_rax,
mov_rdx_rbx,
6c@@
2e@@
mov_esi_dword_ptr_[r@@
get
56@@
mov_ebp_eax,
57@@
5c@@
xor_ebp_ebp,
mov_qword_ptr_[rip+0x2@@
60@@
8d@@
mov_rbx_qword_ptr_[r@@
call_0x4@@
_0x10,
2d@@
mov_eax_dword_ptr_[rip+0x2@@
xor_r12d_r12d,
add_rsp_0x10,
90@@
80@@
4a@@
_3,
70@@
68],
80],
cmp_eax_-1,
_8,
5b@@
58@@
mov_r12_rdi,
54@@
mov_dword_ptr_[rbx+0x@@
97@@
call_0xfffffffffffffb@@
mov_rax_qword_ptr_[rax+8],
9c@@
fe@@
1f@@
_0x20,
4c@@
mov_edi_dword_ptr_[r@@
5e@@
9b@@
jmp_0xfffffffffffffd@@
sub_rsp_0x20,
ff@@
96@@
10,
9a@@
5d@@
mov_edx_0x1@@
fc@@
mov_ecx_eax,
call_0xfffffffffff@@
mov_rsi_r14,
94@@
ea@@
mov_rsi_qword_ptr_[r@@
fa@@
9d@@
test_esi_esi,
47@@
jae_0x@@
0]_0,
mov_eax_ebx,
98@@
8]_rax,
mov_rax_qword_ptr_[rbp-0x30],
di+0x@@
test_r12_r12,
movzx_eax_al,
mov_rdx_rbp,
mov_r12_rsi,
ec@@
bb@@
78],
je_9,
movzx_edx_byte_ptr_[r@@
fd@@
f0@@
20,
lea_eax_[r@@
mov_rdx_qword_ptr_[r@@
f7@@
1@@
32@@
call_0xfffffffffffb@@
4d@@
call_0xfffffffffffffa@@
3f@@
mov_eax_dword_ptr_[r@@
9e@@
mov_r12_qword_ptr_[r@@
fb@@
86@@
00,
]_rax,
90,
35@@
mov_qword_ptr_[rsp+0x10]_rax,
4b@@
add_rsp_0x28,
mov_rbp_qword_ptr_[r@@
90],
_edi,
mov_rax_qword_ptr_[rbp-0x48],
mov_edx_0x4@@
_dword_ptr_[r@@
66@@
]_al,
48@@
je_0xa,
6d@@
25@@
_esi,
cmp_eax@@
_ebx,
mov_rax_rdx,
dd@@
44@@
xor_r9d_r9d,
mov_edi@@
mov_rax_qword_ptr_[rsp+0x18],
88],
24],
6b@@
mov_rdi_qword_ptr_[rip+0x2@@
mov_eax_r12d,
6a@@
mov_eax@@
lea_rcx_[r@@
call_0xfffffffffffa@@
mov_rax_qword_ptr_[rip+0x20@@
add_rax_1,
_r12d,
mov_rdi_qword_ptr_[rsp+8],
18,
mov_esi_eax,
je_0xc,
a0],
mov_rdx_r13,
_ebp,
67@@
mov_rax_qword_ptr_[rbp-0x58],
cmp_edx@@
14],
mov_rax_qword_ptr_[r@@
mov_rdi_qword_ptr_[rax],
80,
test_ebx_ebx,
_0x40,
55@@
88@@
mov_r13_qword_ptr_[r@@
8a@@
mov_edi_0x40@@
2c],
33@@
mov_r13_rax,
movzx_eax_word_ptr_[r@@
mov_rax_qword_ptr_[rdi],
2f@@
_ecx,
98,
sub_rsp_0x28,
8c@@
bx+0x@@
set
34],
23@@
30,
87@@
mov_qword_ptr_[rsp+0x28]_rax,
mov_rcx_qword_ptr_[rsp+8],
_edx,
test_rcx_rcx,
_r8d,
38,
28,
mov_eax_ebp,
test_edi_edi,
_r9d,
mov_dword_ptr_[rip+0x@@
test_r12d_r12d,
8]_rdx,
bx],
18],
mov_rdi_qword_ptr_[r@@
call_0xfffffffffffff@@
_0xa,
mov_rdx_qword_ptr_[rax],
]_4,
mov_rax_rbx,
40,
mov_r14_qword_ptr_[r@@
12],
_rdx,
je_0x4@@
8b@@
mov_eax_dword_ptr_[rbp-0x@@
call_0xffffffffffff8@@
test_ebp_ebp,
mov_rax_qword_ptr_[rax+0x10],
je_0xb,
mov_rax_qword_ptr_[rip+0x@@
mov_eax_edx,
10],
je_0xe,
mov_qword_ptr_[rsp+0x1@@
mov_rax_qword_ptr_[rbx],
mov_esi_0x40@@
0
mov_qword_ptr_[rbp-0x18]_rdi,
ff,
ed@@
_0x4@@
_5,
mov_rdi_qword_ptr_[rbx],
bp],
cmp_rax@@
mov_byte_ptr_[rsp+0x@@
cmp_byte_ptr_[r@@
mov_rax_qword_ptr_[rsp+0x10],
e0],
ax+0x@@
64@@
98],
]@@
cmp_qword_ptr_[rbp-0x@@
call_0xa@@
repe_cmpsb_byte_ptr_[rsi]_byte_ptr_[rdi],
7a@@
b0],
9
call_rax,
_r13d,
db
mov_rax_qword_ptr_[rsp],
jmp_rax,
ee@@
mov_rsi_rsp,
8]_eax,
mov_rsi_r15,
e0@@
]_2,
call_0x3@@
6f@@
6e@@
mov_r15_qword_ptr_[r@@
jne_0xc,
99@@
xor_r13d_r13d,
aa@@
mov_r8_qword_ptr_[r@@
mov_qword_ptr_[rsp]_rax,
9f@@
c
call_0x7@@
call_0xffffffffffff9@@
je_0xf,
29@@
7d@@
eb@@
pxor_xmm0_xmm0,
mov_edx_2,
mov_r8d_dword_ptr_[r@@
cc@@
c0@@
mov_qword_ptr_[rbp-0x18]_rax,
e0,
7b@@
95@@
push_0,
13],
add_rsp_0x20,
je_0x12,
mov_edi_3,
mov_edx_0x@@
60,
mov_qword_ptr_[rbp-0x10]_rax,
]_eax,
mov_r15d_eax,
7c@@
c0,
_7,
mov_rax_qword_ptr_[rbp-0x40],
mov_dword_ptr_[rax+0x@@
mov_rcx_rbx,
sete_al,
_rcx,
_0x@@
c0],
jne_0x3@@
_r12,
46@@
test_r13_r13,
call_0xffffffffffff6@@
mov_rdi_qword_ptr_[rip+0x20@@
jmp_7,
mov_rdi_qword_ptr_[rip+0x@@
f0],
1b,
4e@@
mov_rcx_r12,
8e@@
cmp_al@@
_rbp,
50,
_r14d,
mov_rcx_rdx,
_0x30,
mov_qword_ptr_[rip+0x@@
84@@
mov_byte_ptr_[r@@
5f@@
mov_r12_rdx,
mov_rsi_qword_ptr_[rsp+8],
cmp_qword_ptr_[r@@
pop_rdx,
_6,
bp+0x@@
call_0xb@@
jg@@
8]_rdi,
0]_rdx,
je_0xd,
ea,
15,
45@@
48,
1d,
ja_0xffffffffffffff@@
_qword_ptr_[r@@
mov_esi_0,
64,
call_0xffffffffffff0@@
mov_edx_0x2@@
8]@@
17,
58,
ja@@
lea_r9_[rip+0x@@
mov_qword_ptr_[rbp+0x@@
93@@
ja_0x1@@
si],
mov_r14_rax,
42@@
]_xmm0,
mov_byte_ptr_[rbp-0x@@
6
d0],
12+0x@@
and_eax@@
mov_qword_ptr_[rip+0x20@@
b
19,
mov_word_ptr_[r@@
_r13,
5
mov_qword_ptr_[rax]_rdx,
bx@@
je_0x11,
movzx_ecx_byte_ptr_[r@@
14,
8]_rcx,
_r15d,
9b,
88,
1e,
13,
8]_1,
mov_edx_0,
jmp_0x5@@
11,
12,
e8],
68,
97,
cmp_ebx@@
4f@@
77@@
mov_rdi_rdx,
b8],
_eax,
a0@@
3c],
jmp_0x2@@
92@@
94,
68@@
15],
96,
jmp_0xffffffffffff@@
4
8f@@
mov_eax_dword_ptr_[rax+0x@@
jns@@
a8],
_rbx,
mov_rbx_rdx,
c8],
mov_dword_ptr_[rsp+0x@@
1c,
16,
85@@
1
0]_rax,
mov_dword_ptr_[rip+0x20@@
99,
movsxd_rdx_eax,
9d,
cmovne@@
91,
je_8,
mov_qword_ptr_[rax+0x@@
4]_0,
mov_rdx_r14,
mov_dword_ptr_[rbp+0x@@
_0xc,
and_edx@@
mov_rdx_qword_ptr_[rip+0x2@@
mov_rdx_qword_ptr_[rsp+8],
bx+0x1@@
e
call_0x6@@
mov_r13_rsi,
mov_r15_rax,
65@@
9c,
_0x1@@
9e,
mov_ecx_1,
92,
mov_rbp_rdx,
mov_r13_rdi,
95,
_0x18,
call_qword_ptr_[r@@
xor_r15d_r15d,
mov_eax_dword_ptr_[rip+0x20@@
mov_rdi_rsp,
8
e8,
mov_qword_ptr_[rbp-8]_rdi,
b0@@
cmove@@
mov_rdi_qword_ptr_[rsp+0x10],
jne_9,
1f,
test_dl_dl,
mov_rax_qword_ptr_[rax+0x18],
xor_r14d_r14d,
1a,
9a,
93,
9f,
cmp_dl@@
js@@
lea_rdx_[rax+1],
xor_rbx_qword_ptr_fs:[0x28],
7
mov_r9d@@
test_r13d_r13d,
f
di],
7e@@
ca@@
d
0]_eax,
d0@@
cmp_dword_ptr_[r@@
jb@@
c]@@
add_rsp_0x38,
3c,
call_0xfffffffffffed@@
3d,
]_-1,
0]_rsi,
movsxd_rax_dword_ptr_[r@@
a
2
_r14,
mov_eax_dword_ptr_[rip+0x@@
_rsi,
test_r14_r14,
_0x7@@
mov_byte_ptr_[rax]_0,
lea_r12_[r@@
mov_ebx@@
shl_rax_4,
bp@@
call_0x5@@
call_0xfffffffffffea@@
mov_qword_ptr_[rsp]_0,
bx+8],
add_eax_1,
ba@@
4]_edx,
37,
si+0x@@
add_qword_ptr_[rbp-0x@@
mov_rdi_qword_ptr_[rsp],
35,
3
call_0xffffffffffff4@@
sub_rsp_0x38,
0]@@
call_0xc@@
2d,
je_0x16,
je_0x10,
mov_rdi_qword_ptr_[rsp+0x18],
_0x5@@
sub_rsp_0x30,
4]@@
70,
39,
dx+0x@@
jg_0xffffffffffffff@@
mov_rax_r12,
33,
b0,
mov_ebp@@
mov_qword_ptr_[rdi+0x@@
test_r8d_r8d,
mov_r9_qword_ptr_[r@@
0]_rcx,
test_r15_r15,
31,
lea_edx_[r@@
3f,
4]_eax,
78,
34,
je_0x18,
mov_r9d_dword_ptr_[r@@
test_r14d_r14d,
7f@@
c8,
test_byte_ptr_[r@@
3a,
cd@@
mov_r13_rdx,
je_0x15,
_0x3f,
cb@@
3b,
24,
_0x80,
cmp_eax_2,
mov_rsi_qword_ptr_[rax],
mov_edi_ebp,
4]_1,
mov_rcx_rbp,
di+8],
mov_edi_ebx,
mov_eax_dword_ptr_[rbx+0x@@
ax+0x1@@
mov_rdx_rsp,
cmp_edi@@
]_8,
cmp_rdx_rax,
2c,
32,
je_0x1b,
je_0x17,
_0xf,
setne_al,
je_0x13,
2e,
21,
call_0xfffffffffffee@@
29,
mov_r13d_eax,
_r15,
mov_edx_dword_ptr_[rbp-0x@@
lea_rax_[rbp-0x@@
jne_7,
je_0x1a,
add_rax@@
3e,
mov_rdi_rcx,
di@@
call_0x8@@
d8],
_rdi,
call_0xfffffffffffec@@
26,
je_0x1d,
mov_rax_qword_ptr_[rsp+0x28],
call_qword_ptr_[rax+0x@@
4c],
15+0x@@
lea_rbp_[r@@
mov_esi_0x1@@
f0,
mov_edi_0x6@@
call_0xffffffffffff5@@
call_0xfffffffffffff0@@
mov_qword_ptr_[rsp+0x20]_rax,
cmp_ecx@@
mov_rdi_rsi,
36,
25,
jmp_0xfffffffffff@@
lea_r13_[r@@
76@@
23,
2a,
2b,
mov_ecx_0xffffffff,
_0x6@@
74@@
mov_eax_dword_ptr_[rsp+0xc],
jge_0x@@
mov_qword_ptr_[rbx]_rax,
or@@
lea_rdx_[rbp-0x@@
mov_ecx@@
b8,
je_0x5@@
ax],
22,
1]_0,
mov_qword_ptr_[rbx+0x1@@
lea_rbx_[r@@
20]_0,
ef,
ef@@
87,
je_0x14,
sub_eax_1,
mov_qword_ptr_[rsp+8]_0,
js_0x1@@
78@@
mov_qword_ptr_[rsp+0x38]_rax,
and@@
push_rdx,
85,
lea_rax_[rsp+0x@@
d0,
da@@
89,
movups_xmmword_ptr_[r@@
movzx_edx_word_ptr_[r@@
27,
mov_rcx_r13,
_9,
mov_r14d_eax,
movsxd_rdx_edx,
86,
and_eax_1,
je_0x19,
call_0x10@@
f8,
bd@@
8d,
mov_rax_qword_ptr_[rdi+0x@@
dx],
mov_qword_ptr_[rbp-0x@@
2f,
pop_rcx,
6d,
be@@
mov_edx_0x3@@
sub_eax@@
lea_r14_[r@@
84,
mov_rdx_rsi,
83,
cmp_rdx@@
je_0x1c,
_r10d,
test_r15d_r15d,
6c,
63,
sp+0x1@@
mov_rsi_rdi,
mov_rdx_qword_ptr_[rbp-0x@@
mov_rax_qword_ptr_[rbp],
mov_rcx_qword_ptr_[rsp+0x18],
_cl,
mov_r12d@@
mov_qword_ptr_[r@@
call_0x@@
print
81,
5d,
ip+0x20@@
jne_0x4@@
mov_edi_7,
75@@
5c,
add_rbx_1,
mov_dword_ptr_[rbx+0x1@@
61,
bx+0x10],
]_ax,
14+0x@@
65,
13+0x@@
bc@@
_0x8@@
_dl,
mov_rdx_qword_ptr_[rbp-0x18],
_0xb,
8]_edx,
call_0xd@@
bf,
8c,
cmp_esi@@
d8,
39@@
4d,
jmp_0x6@@
mov_dword_ptr_[rsp+0xc]_eax,
41,
si@@
cmp_word_ptr_[r@@
7f,
a0,
e2,
55,
call_0xfffffffffffeb@@
53,
7d,
mov_dword_ptr_[rsp+0x1@@
44,
45,
mov_rax_qword_ptr_[rax+0x@@
mov_esi_ebp,
mov_qword_ptr_[rsp+0x4@@
mov_qword_ptr_[rsp+0x10]_0,
mov_eax_ecx,
54],
69,
57,
42,
mov_eax_dword_ptr_[rbp+0x@@
_r8,
mov_rsi_qword_ptr_[rsp+0x10],
cmp_ebp@@
59,
mov_rax_qword_ptr_[rax+0x20],
5a,
4c,
e9,
8]_rsi,
46,
mov_dword_ptr_[rax]_0,
_0x3@@
jbe_0xffffffffffffff@@
mov_rax_qword_ptr_[rbp-0x68],
5e,
54,
_-1,
6b,
82,
db@@
bp+8],
e3,
mov_word_ptr_[rsp+0x@@
66,
e5,
8e,
mov_edx_r12d,
4b,
51,
mov_qword_ptr_[rsp+0x18]_0,
75,
file
jb_0xffffffffffffff@@
5f,
6a,
5b,
cx@@
mov_ecx_0x4@@
cmp_qword_ptr_[rbp-8]_0,
49,
56,
79,
4e,
67,
7a,
e6,
je_0x1e,
jne_0x10@@
6e,
ed,
mov_edi_2,
f8],
mov_esi_edx,
6f,
mov_qword_ptr_[rax+0x1@@
52,
mov_rax_qword_ptr_[rbp+0x@@
mov_rax_qword_ptr_[rax+0x38],
62,
b5,
7c,
47,
mov_rsi_qword_ptr_[rsp+0x18],
7e,
imul@@
mov_rdx_r15,
]_edx,
mov_r8d@@
call_0xfffffffffffef@@
call_0xffffffffffffea@@
b6,
73,
mov_rax_qword_ptr_[rsp+0x20],
4a,
e7,
7b,
lea_rax_[rip+0x2@@
1]@@
dc@@
mov_qword_ptr_[rbp-0x20]_rsi,
bb,
_0x2f,
43,
mov_r8d_eax,
72,
di+0x1@@
11],
]_dl,
-0x@@
sub_rdx_rax,
4f,
mov_rdx_qword_ptr_[rsp],
_0x22,
71,
call_0xfffffffffff9@@
e4,
jne_0xb,
add_rdx_rax,
mov_eax_dword_ptr_[rbp-4],
74,
je_0x1f,
76,
jmp_0xfffffffffffffea@@
mov_r14d@@
bc,
mov_esi_2,
jmp_3,
mov_dword_ptr_[rdi+0x@@
f5,
mov_rax_qword_ptr_[rax+0x70],
jne_0xa,
20]@@
44],
ca,
push@@
eb,
_0x1f,
ax+r@@
mov_rdi_qword_ptr_[rbx+8],
_dword_ptr_[rip+0x@@
_0x2@@
77,
b3,
mov_r14_rdi,
b9,
b1,
je_0x25,
mov_ecx_edx,
mov_r8_rax,
ec,
je_0x20,
cd,
cmp_cl@@
movzx_esi_byte_ptr_[r@@
_byte_ptr_[r@@
mov_rdx_qword_ptr_[rbp-8],
je_0x22,
fe,
c4,
mov_qword_ptr_[rsp+0x30]_rax,
pop_rax,
call_0xffffffffffff@@
8a,
jne_0x10,
mov_edi_dword_ptr_[rax],
1c],
b7,
je_0x39,
db,
8f,
fd,
ee,
_rax,
0],
jmp_0x7@@
e1,
mov_qword_ptr_[rsp+0x20]_0,
a8,
lea_rsi_[rip+0x2@@
mov_qword_ptr_[rsp+0x40]_0,
jne_0x13,
8b,
mov_rdi_qword_ptr_[rbx+0x@@
jne_0x11,
cmp_r12d@@
mov_r13d@@
lea_edx_[rax+1],
_r11d,
mov_eax_dword_ptr_[rbp-0x14],
add@@
lea_r8_[r@@
je_0x21,
add_rdi@@
mov_rsi_qword_ptr_[rsp],
_0x2d,
sub_rsp_0x1@@
jne_0xe,
add_dword_ptr_[rbp-0x@@
ax+0x10],
jne_0xd,
mov_dword_ptr_[r@@
b4,
mov_rsi_qword_ptr_[rip+0x2@@
mov_qword_ptr_[rax]_0,
mov_rax_qword_ptr_[rbp-0x50],
]_3,
ja_0x@@
mov_rbx_qword_ptr_[rip+0x2@@
ba,
mov_esi_ebx,
jl@@
f4,
pop_rsi,
_dword_ptr_[rip+0x2@@
add_dword_ptr_[r@@
d2,
mov_rax_rcx,
xor_rdx_qword_ptr_fs:[0x28],
init
_0xffffffff,
28]_0,
mov_edx_0xa,
c]_0,
mov_ebx_dword_ptr_[r@@
and_ecx@@
mov_rdi_qword_ptr_[rbp],
mov_rcx_qword_ptr_[rip+0x2@@
rep_stosq_qword_ptr_[rdi]_rax,
ce,
shr@@
add_eax@@
]_cl,
mov_qword_ptr_[rbp-0x20]_rax,
c5,
fb,
mov_esi_0x5@@
b2,
f6,
30]_0,
da,
5c],
bx+0x18],
mov_rax_rbp,
mov_rdx_rcx,
mov_eax_dword_ptr_[rdi+0x@@
si+8],
call_0xfffffffffff8@@
je_6,
lea_r15_[r@@
cf,
mov_edx_dword_ptr_[rip+0x2@@
mov_eax_0x4@@
lea_rdi_[rip+0x2@@
f7,
8]_rbx,
je_0x12@@
mov_edi_0,
f1,
ax+8],
cmp_eax_0x1@@
fa,
c3,
c1,
test_r8_r8,
di+0x10],
parse
be,
f9,
cmp_qword_ptr_[rbx+0x@@
mov_qword_ptr_[rbp-0x28]_rdi,
shl_rax_3,
_0x40@@
call_0xffffffffffff3@@
f3,
jne_0x12@@
dd,
mov_rdx_qword_ptr_[rsp+0x10],
c6,
call_0xffffffffffe@@
f2,
mov_rdi_qword_ptr_[rdi],
_al,
d5,
fc,
38]_0,
mov_esi_0x@@
_0xd,
mov_qword_ptr_[r12+0x@@
mov_qword_ptr_[rsp+8]_rsi,
mov_esi@@
12+0x1@@
mov_rdi_qword_ptr_[rsp+0x20],
cmp_dword_ptr_[rsp+0x@@
mov_edi_0xa,
c]_eax,
cc,
mov_rdx_qword_ptr_[rsp+0x18],
cx+0x@@
shl_rdx_3,
cb,
lea_rcx_[rbp-0x@@
sub_rsp_0x48,
c]_edx,
movsxd_rdx_dword_ptr_[r@@
dx@@
mov_rdx_qword_ptr_[rbx+0x@@
cmp_rax_-1,
df,
bd,
c9,
add_rbx@@
mov_rdx_qword_ptr_[rbp-0x10],
lea_rsi_[rip+0xa@@
d3,
d1,
mov_qword_ptr_[rbp-0x28]_rax,
to
je_0x2a,
add_rsi@@
_0x7f,
je_0x28,
_0x100,
mov_qword_ptr_[rsp+0x58]_rax,
mov_dword_ptr_[rax]@@
xcb
mov_qword_ptr_[rsp+8]_rdx,
bx+1],
je_0x2d,
add_rsp_0x48,
jle_0xffffffffffffff@@
je_0x@@
mov_rsi_qword_ptr_[rbx],
lea_r9_[r@@
sp],
c2,
mov_edx_0x40@@
mov_edx_0x5@@
jmp_0x3@@
mov_rcx_qword_ptr_[rbp-0x@@
sp+0x14],
mov_esi_0x2@@
mov_r15d@@
-@@
or_dword_ptr_[r@@
mov_eax_eax,
5a4],
mov_rax_qword_ptr_[rbx+0x@@
mov_byte_ptr_[rsp+0x1@@
mov_r8d_1,
je_0x23,
mov_dword_ptr_[rax+0x1@@
mov_rsi_qword_ptr_[rsp+0x20],
dc,
cx],
mov_edx_ebp,
mov_r14_rsi,
cmp_edx_1,
je_0x29,
ja_0x2@@
mov_rax_rsi,
30]@@
mov_qword_ptr_[rsp+0x48]_rax,
sub_rsp_0x40,
call_0xe@@
cmp_rbx@@
6c],
c7,
_0x28,
sub_rsp@@
64],
seta_al,
mov_edx_ebx,
0]_edx,
jne_0x13@@
mov_esi_r12d,
mov_eax_0x16,
bx+0x20],
_r9,
call_0x9@@
je_0x26,
add_rdx@@
sp+4],
add_rbp@@
call_0xfffffffffff7@@
je_0x24,
test_r9d_r9d,
cmp_edx_eax,
string
cmp_eax_dword_ptr_[rbp-0x@@
lea_rdi_[rip+0x20@@
mov_ebp_esi,
movdqu_xmm0_xmmword_ptr_[r@@
mov_eax_r13d,
ip+0x@@
add_rax_rcx,
add_rsp_0x30,
d4,
d6,
de,
sp+0x18],
call_0xffffffffffffdd@@
add_ebx_1,
mov_qword_ptr_[rsp+0x48]_0,
mov_rdx_qword_ptr_[rbp-0x28],
sp+8],
sqlite3
d7,
dx+r@@
call_0xffffffffffffed@@
+rax@@
lea_ecx_[r@@
bp+0x10],
cmp_rax_rdx,
ax+0x18],
jmp_0x4@@
lea_rsi_[rsp+0x10],
8]_rbp,
call_0xffffffffffffe0@@
mov_edx_0x6@@
bx+0x28],
call_0xfffffffffffe0@@
aa,
add_qword_ptr_[r@@
_0x2e,
lea_rcx_[rsp+0x@@
]_rdx,
mov_r9_rax,
2]_0,
a5,
68]_0,
add_rax_qword_ptr_[r@@
_0x400,
mov_eax_dword_ptr_[rax+4],
bx+r@@
lea_rsi_[rip+0x4@@
a1,
free
jne_0x14@@
mov_edx@@
test_cl_cl,
ad,
mov_edx_dword_ptr_[rax],
add_eax_edx,
sub_rsp_0x58,
jne_0x16,
mov_edx_r13d,
mov_r12d_dword_ptr_[r@@
mov_ebp_dword_ptr_[r@@
mov_rax_qword_ptr_[rbx+8],
mov_rdx_qword_ptr_[rbp-0x20],
mov_qword_ptr_[rsp+0x28]_0,
d9,
mov_rax_qword_ptr_[rbp-0x78],
mov_qword_ptr_[rdx+0x@@
_0xe,
mov_rcx_qword_ptr_[rax],
28]@@
xor_rsi_qword_ptr_fs:[0x28],
12+r@@
call_0xffffffffffff2@@
call_0xffffffffffffec@@
lea_rsi_[rip+0x6@@
mov_rsi_qword_ptr_[rbx+0x@@
43@@
mov_rcx_r14,
name
lea_rax_[rsp+0x20],
+rdx@@
ip+0x2@@
ab@@
a4,
000,
ac,
ad@@
bp+r@@
_word_ptr_[r@@
mov_rdi_qword_ptr_[rbx+0x10],
si+0x1@@
jne_0x12,
_0x14,
mov_edx_4,
list
mov_edx_dword_ptr_[rax+0x@@
movzx_eax_byte_ptr_[rbp-0x@@
sp+0x1c],
_0x16,
or_eax@@
8]_r8,
mov_edi_r12d,
9c],
mov_rax_qword_ptr_[rbp-0x@@
mov_ebx_1,
mov_qword_ptr_[rsp+0x2@@
ab,
lea_rsi_[rip+0x3@@
mov_byte_ptr_[rsp+@@
movzx_ecx_word_ptr_[r@@
sub_rsp_0x68,
jmp_0xffffffffffffffa@@
lea_rdx_[rax*8],
c]_1,
+2],
mov_r14_rdx,
+rcx@@
]_dx,
mov_r12d_1,
a6,
call_0xffffffffffffee@@
12+8],
jne_8,
mov_rsi_qword_ptr_[rbp-0x@@
mov_rcx_qword_ptr_[rbp-8],
ac@@
mov_esi_0x6@@
je_0x31,
mov_rax_qword_ptr_[rsp+0x38],
dec@@
jne_0x15,
cmp_r15d@@
je_0x27,
add_rax_8,
di+r@@
19],
call_0xffffffffffffeb@@
cmp_r12@@
cmp_r8d@@
call_0xfffffffffff6@@
movaps_xmmword_ptr_[rbp-0x@@
mov_ecx_0x1@@
jmp_0xffffffffffffffc@@
28]_rax,
a7,
sbb_al_0,
jne_0x15@@
a9,
jmp_0xffffffffffffffd@@
a2,
mov_r15_rdi,
a3,
mov_rax_qword_ptr_[rbp-0xb8],
inc@@
je_0x6@@
add_rsp@@
jne_0x14,
2]@@
sbb@@
add_rdx_1,
mov_edi_6,
mov_rax_qword_ptr_[rbx+0x10],
lea_rdi_[rsp+0x@@
neg_eax,
add_rsp_0x58,
13+r@@
lea_rax_[rip-0x@@
jmp_0xffffffffffffffb@@
mov_qword_ptr_[rsp+0x3@@
jne_0xf,
mov_rax_qword_ptr_[rax+0x28],
mov_r10d_dword_ptr_[r@@
ae,
mov_rdi_qword_ptr_[rbp+0x@@
mov_rax_rdi,
cmp_r13d@@
8]_r12,
mov_r13d_dword_ptr_[r@@
af,
mov_rdx_qword_ptr_[rax+0x10],
add_rax_rax,
_[rax+1],
je_0x2c,
je_0x30,
lea_rbx_[rip+0x@@
div@@
13+0x1@@
_r10,
mov_rax_qword_ptr_[rbp-0x60],
mov_rdx_qword_ptr_[rax+8],
cmp_eax_dword_ptr_[r@@
lea_r12_[rip+0x@@
lea_rsi_[rip+0x5@@
add_rsp_0x68,
mov_rdi_qword_ptr_[rsp+0x28],
sub_edx_eax,
mov_qword_ptr_[rax+8]_rdx,
_0x38,
je_0x2e,
84],
di+0x18],
mov_rax_qword_ptr_[rax+0x30],
movsx_eax_al,
mov_qword_ptr_[rsp+8]_rcx,
bp+1],
_0x10@@
cmp_qword_ptr_[rsp+0x@@
lea_rax_[rip+0x20@@
mov_edx_dword_ptr_[rbx+0x@@
mov_qword_ptr_[rsp+0x30]_0,
di+0x30],
mov_qword_ptr_[rbp-0x10]_rsi,
jmp_0x8@@
50]_0,
si+0x10],
movsd_qword_ptr_[r@@
mov_r12d_esi,
14+0x1@@
lea_rsi_[rip+0x14@@
8+0x@@
je_0x2b,
cmp_rbp@@
mov_esi_4,
mov_rdi_r8,
di+0x20],
je_0x32,
mov_ecx_0,
mov_qword_ptr_[r12@@
cmp_r14d@@
add_rsp_0x1@@
mov_qword_ptr_[rbp]_rax,
_0xff,
mov_ecx_dword_ptr_[rbp-0x@@
add_ecx@@
movzx_eax_ax,
lea_esi_[r@@
lea_rsi_[rip+0x7@@
mov_r12d_edx,
je_0x2f,
mov_rdx_rdi,
cmp_eax_0x2@@
add_rbx_8,
js_0x@@
test_byte_ptr_[rbx+0x@@
call_0xffffffffffffda@@
mov_edx_dword_ptr_[rsp+0x@@
mov_esi_ecx,
mov_qword_ptr_[rsp+0x5@@
mov_eax_dword_ptr_[rax+0x10],
mov_qword_ptr_[rsp+0x@@
mov_rdx_qword_ptr_[rax+0x@@
jne_0x18,
sp+0x10],
push_qword_ptr_[r@@
dx+0x1@@
cmp_eax_3,
cx+r@@
mov_eax_r8d,
bp-0x@@
+rax*4],
mov_r12_rcx,
jne_0x1b,
mov_qword_ptr_[rbx@@
_qword_ptr_[rip+0x@@
mov_qword_ptr_[rsp+8]_rdi,
mov_dword_ptr_[rbp-0x4@@
mov_edi_4,
jne_0x17,
_0x11,
mov_ebp_1,
ae@@
4]_ecx,
20]_1,
15+0x1@@
mov_rax_qword_ptr_[rdi+8],
lea_r12_[rsp+0x@@
lea_r13_[rsp+0x@@
mov_r8_rbx,
mov_rax_qword_ptr_[r12+0x@@
74],
add
call_0xffffffffffffd0@@
call_0xfffffffffffdd@@
_r11,
ax+0x20],
mov_rbx_qword_ptr_[rbx],
ce@@
movzx_eax@@
lea_rsi_[rip+0x10@@
7c],
cmp_r13@@
21@@
add_edx@@
cmp_rax_qword_ptr_[rbp-0x@@
mov_rax_qword_ptr_[r12],
cmp_byte_ptr_[rax]_0,
jne_0xfffffffffffffd@@
mov_qword_ptr_[rbp-0x38]_rax,
mov_r13_rcx,
mov_eax_r15d,
call_0xffffffffffffef@@
mov_ecx_r12d,
mov_r10d@@
add_r12@@
mov_eax_dword_ptr_[rbp-0xc],
mov_edi_0x5@@
]_xmm1,
mov_eax_dword_ptr_[rax+8],
sp@@
cmp_rsi@@
movsx@@
cmp_rcx@@
59@@
cmp_dword_ptr_[rip+0x2@@
xor_rdi_qword_ptr_fs:[0x28],
rl
mov_dword_ptr_[rsp+8]_eax,
lea_rbp_[rsp+0x@@
mov_rax_qword_ptr_[rsp+0x30],
08],
je_0x35,
mov_r14d_dword_ptr_[r@@
lea_rdx_[rsp+0x10],
mov_rcx_qword_ptr_[rsp+0x28],
mov_qword_ptr_[rbx+8]_rax,
-2],
94],
lea_rbp_[rip+0x@@
mov_qword_ptr_[r15+0x@@
lea_rsi_[rip+0x8@@
_0x3a,
lea_r8_[rsp+0x@@
mov_rcx_qword_ptr_[rsp+0x@@
_[rdx@@
lea_r13_[rip+0x@@
8]_ecx,
cmp_qword_ptr_[rbp-0x10]_0,
mov_eax_r14d,
08,
si+r@@
lea_edi_[r@@
lea_rdx_[rsp+0x30],
49@@
movzx_edi_byte_ptr_[r@@
mov_ecx_2,
sub_rdx@@
de@@
lea_rdx_[rip-0x@@
cmp_rdi_rax,
lea_rdi_[rax+1],
mov_ebx_edi,
15+r@@
mov_qword_ptr_[rbp-0x4@@
mov_edx_8,
sub_dword_ptr_[r@@
mov_rdx_qword_ptr_[rsp+0x28],
sub_edx@@
21],
mov_eax_esi,
+r@@
lea_rdx_[rsp+0x@@
mov_eax_dword_ptr_[rbp-0x1c],
-1],
mov_rbx_qword_ptr_[rip+0x20@@
je_0x33,
mov_eax_edi,
sub_rax@@
53@@
ax@@
cmp_ax@@
lea_rsi_[rip+0xb@@
40]_0,
mov_byte_ptr_[rax]@@
_0xffffff@@
13+8],
lea_rsi_[rip+0xd@@
_0x70,
mov_rax_qword_ptr_[rbp-0x70],
c]_ecx,
mov_ebx_esi,
jmp_0xffffffffffffffe@@
mov_qword_ptr_[r12]_rax,
mov_dword_ptr_[rax]_edx,
69@@
mov_rdx_qword_ptr_[rip+0x20@@
read
_[rax@@
mov_rsi_qword_ptr_[rsp+0x28],
cmp_rax_1,
+rcx],
je_0x36,
jne_0x1a,
je_0x34,
call_0xfffffffffffff7@@
dx+8],
mov_esi_3,
+rdx],
je_0x3d,
test_r10d_r10d,
call_0xffffffffffffca@@
js_0x2@@
lea_rbx_[rsp+0x@@
shr_rdx@@
mov_r13d_edx,
jne_0x19,
info
ja_0x3@@
call_0xfffffffffffe7@@
sar@@
_0xffff@@
jns_0xffffffffffffff@@
8+8],
mov_qword_ptr_[rbp-0x30]_rsi,
call_0xf@@
cmp_r15@@
14+8],
je_0x3c,
mov_rax_qword_ptr_[rsp+0x@@
cmp_dword_ptr_[rbx+0x@@
20]_rax,
mov_edx_ecx,
sub_rax_1,
mov_qword_ptr_[rax+0x10]_rdx,
mov_rcx_rsp,
sp+@@
mov_rdi_qword_ptr_[rdi+0x@@
mov_qword_ptr_[rbp@@
jg_0x1@@
lea_rsi_[rsp+0x@@
and_esi@@
shr_edx@@
*8],
mov_rax_qword_ptr_[rbp-0xa8],
je_0x38,
je_0x37,
mov_byte_ptr_[rbx+0x@@
mov_qword_ptr_[rdx]_rax,
mov_qword_ptr_[rbp-0x30]_rax,
mov_rax_qword_ptr_[r15+0x@@
jmp@@
jmp_0xffffffffffffff9@@
mov_dword_ptr_[rsp]@@
sete_dl,
mov_rcx_qword_ptr_[rip+0x20@@
mov_qword_ptr_[rcx@@
mov_dword_ptr_[rax+@@
mov_qword_ptr_[rbp-0x5@@
_0x5c,
63@@
si+0x18],
find
do
29],
mov_byte_ptr_[rsi+@@
lea_rsi_[rsp+8],
mov_eax_dword_ptr_[rsp+0x@@
mov_esi_r13d,
bp+0x18],
call_0xfffffffffffff8@@
je_0x42,
60]_0,
mov_rdx_qword_ptr_[rsp+0x20],
0]_rbx,
mov_qword_ptr_[rbp-0x6@@
8]_esi,
bp+0x20],
je_5,
-0x30],
14+r@@
bf@@
mov_rdx_qword_ptr_[rip+0x@@
test@@
mov_edi_dword_ptr_[rip+0x@@
mov_ecx_r13d,
movabs_rax@@
movaps_xmmword_ptr_[rsp+0x50]_xmm0,
mov_dword_ptr_[r15+0x@@
mov_rbp_rcx,
mov_r8_rbp,
shl@@
af@@
cmp_qword_ptr_[rbp-0x18]_0,
cmp_dword_ptr_[rip+0x@@
cmp_eax_4,
01,
mov_dword_ptr_[rbp-0x2@@
test_eax@@
c]_esi,
79@@
mov_rsi_qword_ptr_[rip+0x@@
mov_edx_0xffffffff,
lea_rsi_[rip+0x13@@
lea_r14_[rsp+0x@@
mov_qword_ptr_[rsp+0x38]_rcx,
add_ebp_1,
xor@@
-4],
mov_r15d_dword_ptr_[r@@
4]_edi,
mov_r10_qword_ptr_[r@@
18]_0,
lea_rax_[rdx@@
di+1],
add_rax_0x10,
]_rbx,
]_5,
je_0xfffffffffffffd@@
je_0x7@@
mov_r8_r12,
_0x1000,
mov_qword_ptr_[rbp-0x8@@
mov_qword_ptr_[rsp+0x50]_0,
bx+0x30],
+rax*@@
ea],
mov_rbx_qword_ptr_[rsp+0x@@
lea_rsi_[rip-0x@@
mov_ecx_ebx,
mov_rbx_rcx,
mov_qword_ptr_[rsp+0x6@@
22],
9+0x@@
1d],
mov_rcx_qword_ptr_[rsp+0x10],
tm
mov_qword_ptr_[rbp-0x28]_rdx,
call_0xffffffffffffdc@@
0000@@
open
mov_dword_ptr_[rbp-4]_eax,
]_sil,
clones
mov_r9_rbx,
add_rcx@@
8]_r9,
mov_edx_dword_ptr_[rip+0x@@
mov_eax_dword_ptr_[rbp-0x24],
mov_esi_dword_ptr_[rsp+0x@@
200],
16],
mov_dword_ptr_[rsp+0xc]@@
mov_byte_ptr_[rax+@@
mov_edi_dword_ptr_[rip+0x2@@
mov_r8_qword_ptr_[rsp+8],
12+0x10],
mov_rbx_qword_ptr_[rdi],
dx+0x10],
mov_eax_2,
_0xfffffffe,
shr_eax@@
cmp_qword_ptr_[rbp+0x@@
mov_eax_dword_ptr_[rsp+4],
0a,
8c],
bx+4],
mov_qword_ptr_[r13+0x@@
mov_rax_qword_ptr_[rbx+0x18],
0000,
mov_ebp_edi,
_0x50,
+rdx*4],
9d],
]_cx,
mov_edi_0x20,
mov_rdi_qword_ptr_[r12],
sub@@
mov_r9_rdx,
mov_rax_r13,
mov_rcx_r15,
lea_rdi_[rsp+0x10],
movabs_rdx@@
is
_0x200,
test_bl_bl,
movsxd_rdi_edi,
02,
31],
call_0xffffffffffffc0@@
xor_eax_1,
mov_rdi_qword_ptr_[rbp+8],
mov_rdx_qword_ptr_[rbx],
mov_qword_ptr_[rsp+0x68]_rax,
mov_rdi_qword_ptr_[rax+8],
add_r13@@
_r12@@
je_0x3a,
jl_0xffffffffffffff@@
0]_rdi,
mov_r8_r13,
48]_0,
neg@@
test_byte_ptr_[rax+0x1c9]_2,
node
jmp_0xffffffffffffff@@
bp-@@
je_0x45,
mov_byte_ptr_[rax+0x@@
1a],
fe],
je_0x4d,
mov_rax_qword_ptr_[rbp-0x80],
call_0xffffffffffffdb@@
cmp_rax_qword_ptr_[r@@
ev
mov_rcx_qword_ptr_[rsi],
-8],
test_al_1,
lea_rsi_[rip+0xc@@
000@@
_0xf@@
8]_r13,
je_0x3e,
8d],
_0x8000,
ax+0x40],
and_edx_1,
env
mov_qword_ptr_[rsp+0x40]_rax,
jne_0xffffffffffffffed,
mov_qword_ptr_[rax+0x18]_rdx,
mov_qword_ptr_[rsp+8]_r8,
cmp_qword_ptr_[rdi+0x@@
cmp_dword_ptr_[rbp+0x@@
call_0xffffffffffffbb@@
jne_0x1c,
220],
39],
mov_edx_r14d,
_rbx@@
mov_qword_ptr_[r13@@
mov_eax_0x1@@
lea_r9_[rsp+0x@@
e5@@
cx+8],
internal
mov_ecx_dword_ptr_[rsp+0x@@
00],
jae_0xffffffffffffff@@
mov_edx_0x10,
test_byte_ptr_[rax+0x@@
38]_rax,
cmp_r14@@
cx+1],
0]_1,
mov_qword_ptr_[rsp+0x38]_0,
je_0x40,
mov_rax_qword_ptr_[r13+0x@@
mov_byte_ptr_[rip+0x2@@
create
lea_rdx_[rax@@
mov_rax_r8,
05,
mov_ebp_edx,
start
04,
and_eax_0xf000,
movzx_edx_byte_ptr_[rax],
mov_qword_ptr_[rdi@@
jmp_6,
mov_rax_qword_ptr_[rbp-0xc8],
mov_rsi_r8,
mov_esi_0x3@@
lea_rdx_[rip+0x2@@
_r12d@@
call_0xfffffffffffff6@@
mov_ecx_ebp,
mov_byte_ptr_[rcx@@
mov_r11d@@
movsxd_rdx@@
mov_dword_ptr_[rdi+0x1@@
_dword_ptr_[rsp+0x@@
ax+0x30],
mov_qword_ptr_[rsp+0x48]_r9,
e7@@
+rax+1],
ff],
89@@
mov_edx_esi,
jne_0x1e,
mov_eax_dword_ptr_[rbx],
mov_rax_qword_ptr_[r14+0x@@
lea_rsi_[rip+0x12@@
03,
je_0x3f,
fff,
sub_ecx@@
30]_1,
mov_byte_ptr_[rax]_dl,
mov_dword_ptr_[rbx+@@
mov_dword_ptr_[r12+0x@@
call_0x20@@
je_0x48,
user
je_0x5d,
06,
close
+rax*2],
jne_0x1d,
sub_rsp_0x50,
lea_rdi_[rip+0x3@@
mov_rdi_qword_ptr_[rbp-0x@@
mov_esi_0xa,
cmp_sil@@
mov_rdi_qword_ptr_[rsp+0x30],
58]_0,
mov_r13d_1,
_0x3d,
_qword_ptr_[rbp-0x@@
0c,
di+0x28],
movzx_esi_word_ptr_[r@@
_ebp@@
+rdx*@@
e4@@
mov_qword_ptr_[rsp+0x40]_r8,
call_0xfffffffffffe6@@
0d,
cmp_rbx_rax,
je_0x3b,
fd],
12+1],
cf@@
_r12b,
lea_r14_[rip+0x@@
cmp_eax_0x6@@
mov_rcx_qword_ptr_[rsp],
lea_edx_[rax@@
mov_dword_ptr_[rdx+0x@@
mov_rdx_qword_ptr_[rbp-0x30],
10]_0,
call_0xfffffffffffe8@@
mov_edi_r13d,
_0,
write
mov_esi_0x20,
mov_edx_dword_ptr_[rsp+0xc],
lea_r15_[rsp+0x@@
mov_qword_ptr_[rax@@
mov_r15_rsi,
sub_rax_rdx,
28]_1,
1e],
8+0x1@@
mov_rcx_qword_ptr_[rip+0x@@
si+0x20],
mov_r8@@
mul@@
+4],
+8]_0,
mov_rdi_qword_ptr_[rbx+0x18],
mov_rdx_qword_ptr_[rbp-0x38],
check
setne@@
mov_rax_qword_ptr_[rax+0x40],
e6@@
9]_0,
0e,
cmp_r9d@@
_r9@@
js_0xffffffffffffff@@
lea_rdi_[rbx+0x@@
mov_edx_3,
0f,
call_0xfffffffffff0@@
mov_qword_ptr_[rbp-0x7@@
ax+0x70],
mov_r13d_esi,
mov_rdx_qword_ptr_[rbp+0x@@
test_sil_sil,
call_0xfffffffffffd0@@
09,
call_0xffffffffffffde@@
sub_rsp_0xd8,
b7@@
_0x800,
destroy
mov_ebx_edx,
lea_rdi_[rip+0x4@@
mov_qword_ptr_[rdx+0x1@@
jne_0xfffffffffffffff1,
test_dil_dil,
jmp_0xe,
_[rax+r@@
jne_0xfffffffffffffff0,
_r8b,
cmp_qword_ptr_[rip+0x2@@
mov_rax_qword_ptr_[rbp-0x88],
0b,
32],
dd],
70]_0,
mov_qword_ptr_[rdx@@
call_0xffffffffffee@@
c7@@
_0x20@@
shr_rax@@
call_0xffffffffffec@@
jne_0xffffffffffffffee,
f6@@
cx+0x1@@
je_0x41,
je_0x44,
jne_0x20,
2a],
mov_rax_qword_ptr_[rbp-0x10@@
mov_rcx_-1,
add_esi@@
call_0xfffffffffffe4@@
_0x78,
mov@@
mov_qword_ptr_[rdi+0x1@@
07,
bb],
jne_0xffffffffffffffea,
17],
mov_ecx_0x40@@
mov_edi_0x10,
mov_word_ptr_[rsp+0x1@@
call_0xffffffffffffcc@@
41],
je_0x43,
mov_rax_qword_ptr_[rax+0x1@@
mov_esi_0x8@@
mov_rax_qword_ptr_[rsp+0x48],
push_rcx,
mov_qword_ptr_[rbp-0x38]_rdi,
si+1],
mov_qword_ptr_[rbp-0x10@@
mov_dword_ptr_[rsp]_eax,
movzx_r8d_byte_ptr_[r@@
call_0x1a@@
mov_edx_0x8@@
1b],
lea_rsi_[rip+0x1@@
ax+0x28],
mov_qword_ptr_[rsp+0x30]_rdx,
mov_ecx_4,
+rax],
jne_6,
mov_r10@@
sub_rsp_0x78,
movsxd_rdi@@
1f],
_0x64,
_0xa@@
cmp_bl@@
jne_0x1f,
mov_qword_ptr_[r12+0x1@@
mov_edx_0x7@@
new
_qword_ptr_[rsp+8],
mov_qword_ptr_[rsp+0x60]_0,
call_qword_ptr_[rax+8],
mov_esi_0x7@@
mov_rax_qword_ptr_[rbp+0x10],
mov_qword_ptr_[r14+0x@@
mov_rsi_qword_ptr_[r12],
12+0x18],
38]_1,
call_0xfffffffffffff5@@
mov_rcx_rsi,
mov_qword_ptr_[rax+8]_0,
jmp_0x11,
and_edi@@
call_0xfffffffffffda@@
f8@@
jne_0x23,
movaps_xmmword_ptr_[rsp+0x60]_xmm1,
mov_rdx_qword_ptr_[rax+0x18],
call_0xfffffffffff5@@
mov_r11d_dword_ptr_[r@@
lea_rcx_[rip+0x20@@
movaps_xmmword_ptr_[rsp+0x70]_xmm2,
call_0xfffffffffffe9@@
lea_rax_[rax@@
mov_rax_qword_ptr_[r13],
+rdx*8],
jmp_0x15,
26],
mov_r9d_1,
sbb_eax_eax,
jmp_0x14,
movsx_eax_byte_ptr_[r@@
mov_qword_ptr_[rbp-0x3@@
c6@@
movaps_xmmword_ptr_[rsp+0x80]_xmm3,
mov_rsi_qword_ptr_[rbp+0x@@
movaps_xmmword_ptr_[rsp+0x90]_xmm4,
movaps_xmmword_ptr_[rsp+0xa0]_xmm5,
movaps_xmmword_ptr_[rsp+0xb0]_xmm6,
call_0xffffffffffed@@
mov_eax_dword_ptr_[rsp+8],
mov_rdi_qword_ptr_[rdi+8],
add_r14@@
call_0xffffffffffffcb@@
ext2fs
movaps_xmmword_ptr_[rsp+0xc0]_xmm7,
mov_esi_0x400,
main
call_0xffffffffffffcd@@
w@@
fff@@
pop_rdi,
je_0x4a,
jmp_0xffffffffffffff8@@
test_al_2,
test_r9_r9,
jne_0x22,
log
_bl,
mov_rax_qword_ptr_[rbx+0xe0],
mov_edx_dword_ptr_[rbp+0x@@
movaps_xmmword_ptr_[rsp+0x@@
and_eax_2,
mov_dword_ptr_[rsp+8]_edx,
jmp_0xfffffffffffff@@
mov_ecx_0x80,
14+1],
shl_rax_2,
or_byte_ptr_[r@@
cmp_r8@@
sp+0x10@@
mov_qword_ptr_[rsp]_rsi,
mov_r8_rdi,
25],
mov_dword_ptr_[rbp-0x14]_eax,
f5@@
mov_dword_ptr_[rsp+0x10]_eax,
mov_esi_0x2f,
18]_rax,
cmp_byte_ptr_[rdx]_0,
test_byte_ptr_[rbp+0x@@
movsd_xmm0_qword_ptr_[r@@
ja_0x4@@
jne_0x20@@
add_rbp_1,
_r13b,
e8@@
mov_dword_ptr_[rsp+0xc]_edx,
]_6,
je_0x49,
mov_r8_qword_ptr_[rip+0x2@@
ss@@
cmp_ecx_1,
ic
*8+0x@@
_rdi@@
jne_0x2a,
jmp_0xffffffffffffff7@@
sete@@
jne_0x25,
cmp_eax_0x7@@
and_rax@@
+rdx*2],
cmovbe@@
lea_rsi_[rsp+0x20],
mov_qword_ptr_[rbx]_0,
30]_rax,
movzx_eax_byte_ptr_[rbx],
mov_qword_ptr_[rbp-0x18]_rdx,
3e],
mov_dword_ptr_[rsp+0x2@@
or_ecx@@
_0x12,
mov_qword_ptr_[r13]_rax,
rep
_0x1c,
test_byte_ptr_[rdi+0x134]_4,
mov_rax_qword_ptr_[rbx+0x20],
mov_dword_ptr_[rsp+0xc]_0,
100@@
91],
]_0x4@@
jmp_0x12,
and_ebx@@
lock
mov_esi_r14d,
mov_qword_ptr_[rbp-0x40]_rax,
]_rbp,
mov_rbx_qword_ptr_[rax],
mov_ecx_dword_ptr_[rax],
repmgr
bx+@@
mov_r14_rcx,
99],
ax+4],
mov_rdi_qword_ptr_[rsp+0x38],
+rcx*@@
+rcx*4],
cmp_byte_ptr_[rbp-0x@@
mov_dword_ptr_[rdx]_eax,
14]@@
b8@@
mov_byte_ptr_[rbp@@
call_0xffffffffffffdf@@
jne_0x21,
13+0x18],
cmp_rdi@@
call_0xffffffffffffba@@
je_0x50,
lea_rdx_[rax-1],
register
sub
and_ebp@@
je_0x46,
mov_dword_ptr_[rsp+0x3@@
mov_eax_dword_ptr_[rax+0x18],
a4],
cmp_qword_ptr_[rip+0x@@
bp+@@
f2@@
8]_r14,
2e],
jb_0x1@@
mov_eax_dword_ptr_[r12+0x@@
lea_rsi_[rip+0x20@@
or_edx@@
mov_byte_ptr_[rax@@
c4@@
call_0xfffffffffffdc@@
di+@@
_0x13,
jne_0xffffffffffffffeb,
test_r11d_r11d,
13+1],
15+8],
je_0x55,
mov_qword_ptr_[rsp]_rdx,
+3],
je_0x4b,
mov_r8_rdx,
_0x68,
mov_r9_rbp,
3a],
cmp_byte_ptr_[rbx]_0,
bx+2],
mov_r8_rcx,
jne_0xffffffffffffffec,
mov_rsi_qword_ptr_[rbx+8],
a7@@
35],
add_r8@@
cmp_byte_ptr_[rsp+0x@@
0]_rbp,
_0xffff,
+8],
je_0x47,
mov_rax_qword_ptr_[rbp-0xd8],
_0xfffffffb,
mov_qword_ptr_[rsp+0x58]_0,
mov_qword_ptr_[rsp+0x78]_rax,
mov_r14d_1,
mov_esi_8,
df@@
mov_rsi_qword_ptr_[rsp+0x30],
sub_eax_edx,
48]_rax,
_0x3c,
mov_dword_ptr_[rsp+0xc]_ecx,
call_0x30@@
jmp_0x1b,
test_byte_ptr_[rip+0x@@
shl_rdx_4,
_r9b,
test_dword_ptr_[r@@
mov_dword_ptr_[rax]_0x16,
8]_0x4@@
dx+@@
b6@@
lea_rdi_[rsp+8],
mov_qword_ptr_[rsi+0x@@
movsxd_rsi@@
jmp_0x13,
0]_r8,
_-0x@@
_ax,
jne_0xffffffffffffffe6,
mov_rax_qword_ptr_[rip+0x22@@
jne_0x28,
jne_0x29,
mov_dword_ptr_[rsp+4]_0x30,
cmp_al_0x2@@
10+0x@@
si+@@
jne_0x24,
mov_rcx_qword_ptr_[rsp+0x58],
add_rsp_0xd8,
2b],
jne_0xffffffffffffffef,
mov_rdi_qword_ptr_[rsp+0x40],
movzx_eax_byte_ptr_[rax+0x@@
mov_dword_ptr_[rsp+0x7@@
call_0xffffffffffffb0@@
movsxd_rbx@@
cmp_qword_ptr_[rax+0x@@
xor_r10d_r10d,
lea_rcx_[rip+0x2@@
di+4],
je_0x56,
jne_0xffffffffffffffe8,
mov_esi_0xffffffff,
jmp_0x16,
add_r15@@
call_0xfffffffffffdb@@
movzx_ebx_byte_ptr_[r@@
jmp_0xc,
movups_xmmword_ptr_[rsp+0x@@
14+0x10],
mov_dword_ptr_[r13+0x@@
mov_r12_r8,
e4],
movzx_eax_word_ptr_[rax],
mov_qword_ptr_[rax+@@
mov_qword_ptr_[rbx+0x10]_rax,
lea_rsi_[rip+0xe@@
ax+0x1c],
mov_r8_r14,
mov_rax_qword_ptr_[rsp+0x40],
c9@@
movzx_edx@@
mov_dword_ptr_[rsp+0xc]_esi,
cmp_eax_edx,
mov_byte_ptr_[rdx@@
mov_qword_ptr_[rbp-0xe@@
mov_r13d_ecx,
mov_dword_ptr_[rsp+0x20]@@
mov_dword_ptr_[rsi+0x@@
mov_rsi_qword_ptr_[rbp],
mov_eax_0x6@@
call_qword_ptr_[rax],
imul_rax@@
15+0x10],
add_edx_1,
je_0x51,
mov_edi_dword_ptr_[rsp+0x@@
mov_r15_rdx,
3f],
59],
hash
mov_qword_ptr_[rdi]_rax,
_qword_ptr_[rip+0x2@@
mov_eax_dword_ptr_[rsp+0x14],
14]_0,
]_7,
je_0x4f,
or_eax_edx,
]_rdi,
_0x23,
15+1],
3]_0,
js_0x4@@
je_0x4e,
dx+0x18],
lea_rsi_[rbp-0x@@
b4@@
jne_0x2e,
51],
lea_rax_[rbp-0x20],
_0x2000,
call_0x37@@
jmp_9,
jne_0x2d,
cmp_qword_ptr_[rbx+0x68]_0,
movzx_ecx@@
_0x2c,
mov_rsi_qword_ptr_[rip+0x20@@
mov_r12d_ecx,
58]_rax,
je_0x57,
2d],
je_0x54,
a8@@
pxor_xmm1_xmm1,
mov_qword_ptr_[rsp+0x98]_rax,
mov_ecx_dword_ptr_[rbx+0x@@
mov_dword_ptr_[rsp+4]@@
_dword_ptr_[rbp-0x@@
bx*8],
mov_ecx_6,
add_rsp_0x78,
jne_0x2b,
mov_rdx_qword_ptr_[rsp+0x30],
error
]_xmm2,
buffer
mov_ecx_7,
mov_qword_ptr_[rbx+@@
sub_esi@@
movzx_eax_byte_ptr_[rdx],
9]@@
mov_r15@@
_ebx@@
movzx_eax_byte_ptr_[rbx+0x@@
f4@@
mov_qword_ptr_[rsp+8]@@
call_0xffffffffffffce@@
imul_eax@@
_rbp@@
mov_eax_dword_ptr_[r15+0x@@
cmp_dword_ptr_[rsp+0x1@@
mov_dword_ptr_[rsp+0x4@@
mov_r11_qword_ptr_[r@@
c8@@
call_0xfffffffffffe5@@
mov_rcx_qword_ptr_[rbx+0x@@
mov_rdi_qword_ptr_[rbx+0x20],
mov_rdx_-1,
test_byte_ptr_[rbx+0x1@@
mov_ecx_r14d,
add_rbp_8,
je_0x4c,
sub_rcx@@
mov_qword_ptr_[rsp+0x50]_rax,
2f],
jne_0xffffffffffffffe9,
10]@@
36],
bp-1],
jne_0xfffffffffffffff2,
lea_rcx_[rip-0x@@
mov_ecx_dword_ptr_[rip+0x2@@
movabs@@
mov_r14d_ecx,
27],
sub_rsi@@
mov_eax_dword_ptr_[rsp+0x18],
sub_rbx@@
61],
and_r12d@@
d7@@
call_0x3c@@
lea_rax_[rsp+0x30],
mov_rdx_qword_ptr_[rdx+0x@@
]_rcx,
jne_0x27,
mov_qword_ptr_[rbp-0x38]_rdx,
next
]_0x20,
_r14b,
mov_dword_ptr_[rdx@@
add_rsi_rax,
mov_eax_dword_ptr_[rax+0x1@@
mov_rdi_r9,
]_rsi,
mov_rbx_qword_ptr_[rsp+8],
23],
dns
jne_0x26,
+@@
_dword_ptr_[rsp+0xc],
call_0xfffffffffffde@@
value
mov_qword_ptr_[rsp+0x10]_rdx,
mov_esi_dword_ptr_[rip+0x2@@
call_0xffffffffffff9a@@
jne_0xffffffffffffffe7,
lea_rdi_[rsp+0x20],
mov_rax_qword_ptr_[rbp+8],
1]_al,
movsxd_rax_ebx,
test_al_4,
call_0x34@@
jne_0x2c,
_xmmword_ptr_[r@@
jmp_0x10,
_0x48,
_dword_ptr_[rbx+0x@@
mov_byte_ptr_[rsi@@
mov_dword_ptr_[rsp+0x1c]_eax,
call_0xffffffffffffaa@@
jmp_0xffffffffffffff6@@
]_si,
ax+0x38],
call_0xffffffffffffbc@@
00000,
jmp_0x18,
path
d6@@
v@@
a4@@
mov_qword_ptr_[rax+0x10]_0,
and_dword_ptr_[r@@
37],
jne_0xa@@
lea_rcx_[rax@@
sub_rsp_0x2@@
add_r12d_1,
dx+0x20],
mov_r14d_edx,
mov_ecx_dword_ptr_[rsp+0xc],
movsxd_rsi_esi,
8]_xmm0,
208],
mov_edi_dword_ptr_[rbx],
mov_rax_qword_ptr_[r15],
call_0xffffffffffffbd@@
mov_dword_ptr_[rsp+4]_0,
mov_rax_qword_ptr_[rbp-0x98],
call_0x3a@@
mov_dword_ptr_[rbp-0xc]_eax,
add_rax_4,
je_0x59,
b4],
je_0x53,
mov_r11@@
cmp_dword_ptr_[rax]@@
3d],
accounts
call_0xffffffffffff9c@@
lea_rdi_[rip+0xa@@
13+0x10],
_ecx@@
and_r8d@@
lea_rdx_[rsp+8],
je_4,
mov_rax_qword_ptr_[rsi],
mov_rdx_qword_ptr_[rbx+8],
lea_rdx_[rsp+0x20],
*2],
_0x24,
ax+@@
cmp_byte_ptr_[rdi]_0,
mov_dword_ptr_[rbp-4]_edi,
shr_ecx_3,
lea_r15_[rip+0x@@
add_rcx_1,
je_0x52,
lea_edx_[rax-1],
sub_rsp_0x88,
mov_ecx_8,
bx*@@
si+4],
jmp_0xfffffffffffffdd@@
mov_ecx_0x10,
type
bswap_eax,
je_0x58,
jmp_0xd,
mov_dword_ptr_[rsi@@
+rax*8],
mov_ecx_0x6@@
test_byte_ptr_[rdi+0x@@
test_byte_ptr_[rip+0x2@@
cx-1],
movzx_esi@@
jmp_0xffffffffffffe@@
add_edi@@
8+r@@
mov_dword_ptr_[rbx]_eax,
mov_dword_ptr_[rsi]_eax,
mov_rdi_qword_ptr_[r12+0x@@
mov_edi_0x1@@
cmp_al_0x2f,
mov_qword_ptr_[rsp+0x7@@
mov_rax_qword_ptr_[r14],
3b],
mov_dword_ptr_[rbx]@@
mov_rax_qword_ptr_[rsp+0x1@@
_0x58,
_eax@@
movzx_edi@@
lea_rsi_[rip+0x11@@
verify
lea_eax_[rax@@
je_0x61,
mov_rbx_rbp,
sub_ebx_1,
12+0x20],
mov_r9_r13,
cmp_byte_ptr_[rax]@@
mov_r8d_dword_ptr_[rsp+0x@@
mov_rbp_qword_ptr_[rdi],
bt@@
mov_esi_6,
movsxd_rbp@@
call_0xfffffffffffdf@@
_0x32,
ac],
b5@@
8]_r15,
add_rbx_rax,
lea_r10_[r@@
je_0xffffffffffffffeb,
mov_qword_ptr_[rbp-0x9@@
add_rax_0x20,
movsxd_rcx@@
call_0x38@@
lea_rdi_[rip+0x6@@
mh
33],
mov_rsi_qword_ptr_[rsp+0x38],
c5@@
lea_rsi_[rax@@
a6@@
mov_qword_ptr_[rbp-0x1@@
mov_rax_-0x@@
jmp_0xf,
mov_dword_ptr_[rsp+4]_esi,
mov_esi_0x10,
mov_qword_ptr_[rsp]@@
mov_rdx_r8,
call_0x1c@@
mov_rdi@@
cmp_esi_1,
_xmm0,
c4],
+rax]_0,
call_0xffffffffffffa0@@
mov_rax_qword_ptr_[rbp-0x4@@
mov_eax_dword_ptr_[rbp-0x34],
mov_rax_qword_ptr_[rbp+0x18],
4]_esi,
call_0xffffffffffff9b@@
mov_eax_dword_ptr_[rbp-0x2c],
add_r9@@
config
mov_qword_ptr_[rax]@@
ror@@
mov_dword_ptr_[r14+0x@@
mov_rax_qword_ptr_[rbp-0xb0],
_r13@@
add_rdi_1,
sar_eax_0x1f,
add_rdx_qword_ptr_[r@@
cmp_rsi_rax,
0]_ecx,
sub_rsp_0x4@@
mov_eax_dword_ptr_[rbp-0x10],
mov_r8_rsi,
jne_0x34,
line
call_0x3d@@
sub_rbp@@
_edx@@
bam
*4+0x@@
_byte_ptr_[rsi@@
inc_rbx,
mulsd@@
bx+0x14],
je_0x10@@
mov_r9_qword_ptr_[rsp+8],
mov_eax_dword_ptr_[rdi],
key
mov_rax_qword_ptr_[rbp-0x2@@
_0xfff,
jne_0xffffffffffffffe5,
bx-1],
d8@@
dx+rax],
lea_rdx_[rip+0x3@@
mov_ecx_esi,
mov_edx_dword_ptr_[rbp-0x24],
add_rax_rbx,
je_0x5a,
jne_0x30,
lea_rdi_[rip+0x10@@
mov_r9_r12,
test_bl@@
_edi@@
jne_0x2f,
mov_r8_qword_ptr_[rip+0x@@
mov_qword_ptr_[rsp+0x10]@@
je_0x6d,
jne_0xffffffffffffffe4,
38]@@
ax+0x14],
shl_rax_5,
mov_qword_ptr_[rsi@@
mov_r9@@
mov_rax_qword_ptr_[rsp+0x58],
sar_rdx@@
92],
si-1],
]_ecx,
call_0xffffffffffff9d@@
mov_qword_ptr_[rsp@@
call_0x36@@
mov_dword_ptr_[rsp+8]@@
mov_qword_ptr_[rcx+0x@@
95],
ja_0x5@@
mov_qword_ptr_[rbx+0x20]_rax,
jmp_0x1c,
0000000,
add_rax_2,
mov_qword_ptr_[rsp]_rcx,
bp+4],
jne_0xfffffffffffffff3,
mov_ecx_5,
f4],
_0x1a,
call_0x3b@@
mov_byte_ptr_[rip+0x20@@
49],
cmp_dil@@
inc_rax,
sp+0x@@
24]_0,
mov_qword_ptr_[rsp+0x20]@@
omapi
_0xfffffffffffffff0,
cmp_ebx_1,
_r14d@@
mov_dword_ptr_[rsp+0x14]@@
mov_rbx_qword_ptr_[rsp+0x18],
jmp_0x19,
0]_r12,
mov_ecx_0x@@
mov_rax_qword_ptr_[rbp-0xc0],
_0x19,
call_0x1b@@
mov_esi_dword_ptr_[rsp+0xc],
mov_rcx_qword_ptr_[rsp+0x38],
_0x1e,
and_r13d@@
call_0xffffffffffffcf@@
mov_qword_ptr_[rsp+0x88]_rax,
si+0x28],
call_0xffffffffffff97@@
mov_rax_r15,
mov_dword_ptr_[r13@@
c8]_0,
jne_0x31,
mov_rdx_qword_ptr_[rdx],
je_0xfffffffffffffff@@
mov_rsi_qword_ptr_[rax+8],
cmp_rax_rcx,
mov_rax_qword_ptr_[rbp-0xf0],
mov_rbp_r8,
_0x3b,
a5@@
mov_dword_ptr_[rbp-0x1c]_eax,
je_0x69,
mov_dword_ptr_[rbp@@
mov_r9_r14,
push_rdi,
d4],
mov_r15d_1,
movapd@@
_0x60@@
_r14@@
mov_rbx_qword_ptr_[rip+0x@@
jmp_0xa,
mov_r12@@
sub_rsp_0xa8,
call_0xffffffffffff9e@@
cmp_r9@@
mov_dword_ptr_[rsp+0x18]_eax,
mov_dword_ptr_[rsp+4]_eax,
jne_0xffffffffffffffe2,
jmp_0x17,
lea_rdi_[rip+0x7@@
mov_dword_ptr_[rdi+@@
lea_rsi_[rip+0x15@@
test_byte_ptr_[rax+0x1@@
90]_0,
_r8w,
call_qword_ptr_[rip+0x2@@
9a],
je_0x62,
js_0x3@@
_0xa0,
lea_rdi_[rax@@
1]_1,
]_9,
mov_qword_ptr_[rsp+0x10]_rcx,
or
lea_rdi_[rip+0x5@@
mov_rax_r14,
8+@@
call_0x1d@@
di+0x40],
je_0x8@@
mov_r8d_2,
add_rbx_0x10,
lea_rcx_[rsp+0x10],
mov_dword_ptr_[rsp+0x1c]@@
mov_rcx_rdi,
cmp_eax_0xa,
lea_rax_[rsp+0xe0],
mov_edx_dword_ptr_[rip+0x20@@
mov_edx_dword_ptr_[rbx],
mov_edx_r15d,
mov_rbp@@
movzx_r8d@@
_0x5f,
mov_eax_dword_ptr_[rdx],
cmp_qword_ptr_[rbp-0x20]_0,
call_0xfffffffffffff4@@
cmp_rbx_rbp,
mov_rdx_qword_ptr_[rsp+0x38],
mov_esi_0x42@@
mov_qword_ptr_[rsp+0x18]_rcx,
jne_0x3e,
mov_r9d_eax,
mov_rax_-1,
mov_rsi_qword_ptr_[rbx+0x18],
]_dil,
add_rdx_4,
_0x2b,
cmp_eax_5,
jne_0xfffffffffffffff4,
50]@@
cmp_qword_ptr_[rbp-0x28]_0,
mov_rdx_qword_ptr_[rbx+0x10],
je_0x63,
je_0x66,
mov_rdx_qword_ptr_[rbp],
lea_rsi_[rbx+0x@@
add_rdi_4,
sar_eax@@
210],
34]@@
cmp_al_9,
mov_rax_qword_ptr_[rsi+0x@@
mov_qword_ptr_[rbp-0x48]_rdi,
_0xffff8703,
lea_rdi_[rip+0xd@@
lea_rdx_[rax+0x@@
lea_rsi_[rip+0x9@@
mov_dword_ptr_[rsp+0x14]_eax,
jne_0x3b,
mov_dword_ptr_[rbp-0x5@@
_0x60,
jne_0x36,
je_0x65,
push_rsi,
mov_r8d_0x4@@
bc],
cmp_rax_qword_ptr_[rip+0x@@
inc_eax,
mov_rdx_qword_ptr_[rbx+0x18],
_r15b,
and_ecx_1,
mov_rcx_qword_ptr_[rbp-0x20],
add_rsp_0x40,
je_0x5f,
jne_0x32,
lea_rdi_[rip+0xb@@
mov_rax_qword_ptr_[rdi+0x10],
mov_qword_ptr_[rsp+0x28]_rsi,
test_sil@@
mov_eax_dword_ptr_[rbp-0x20],
bswap@@
lea_rdx_[rip+0x7@@
add_ebx@@
mov_edi_0x60@@
mov_r9d_dword_ptr_[rsp+0x@@
ucomisd@@
io
jmp_0xffffffffffffff5@@
_byte_ptr_[rsp+0x@@
mov_qword_ptr_[rsp+0x70]_0,
ec],
dec_eax,
42],
_[rax-1],
pp
mov_rax_qword_ptr_[rdx],
jne_0x35,
je_0x5b,
movsxd_rcx_ecx,
mov_qword_ptr_[rsp+0x10]_rsi,
mov_rbx_rsp,
shl_eax@@
mov_byte_ptr_[rax+r@@
13+0x20],
3]@@
mov_eax_dword_ptr_[rsp+0x1c],
call_0xffffffffffffe7@@
mov_dword_ptr_[rsp+0x5@@
_rsp,
jne_0x38,
_0xfffffffffffffff@@
_xmm3@@
cmp_dword_ptr_[rbp-4]_0,
je_0x72,
96],
mov_r12_rsp,
mov_eax_dword_ptr_[rdx+0x@@
_0x27,
mov_qword_ptr_[rsp+8]_r9,
mov_r8_r15,
je_0x64,
syscall,
]_0x10,
+1],
_byte_ptr_[rdi],
call_0x2a@@
cmova@@
je_0x60,
context
mov_eax_dword_ptr_[rdi+0x1@@
mov_rdi_r10,
shl_rax@@
ax+0x4@@
cil
mov_dword_ptr_[rsp+0x6@@
jmp_0x1d,
mov_dword_ptr_[rbp-0xd@@
mov_dword_ptr_[rsp+0x1c]_0,
mov_edx_edi,
dx+0x28],
97],
_xmm2@@
jne_0x39,
sub_rsp_0x@@
cdq,
mov_eax_dword_ptr_[rbp-0x18],
69],
]_ebx,
call_0xfffffffffffc0@@
mov_qword_ptr_[rbp-0x48]_rax,
mov_dword_ptr_[rbp]_eax,
call_0xfffffffffffe3@@
d5@@
mov_eax_dword_ptr_[rsi+0x@@
lea_rsi_[rip+0x16@@
80]_0,
call_0xfffffffffffffea@@
je_0x6a,
lea_rdi_[rip+0x12@@
movzx_edx_al,
add_ebp@@
call_0xfffffffffffffec@@
call_0xfffffffffffd7@@
movzx_ebx@@
copy
jmp_0x25,
cmp_byte_ptr_[rip+0x2@@
cmp_ebx_eax,
cmp_rax_rdi,
je_0x5c,
cmp_r10@@
jne_0xfffffffffffffff6,
call_0xfffffffffffbb@@
je_0x79,
mov_edi_r14d,
movsxd_r12@@
mov_r14@@
mov_qword_ptr_[rbx+0x18]_rax,
24]_1,
call_0xffffffffffef@@
je_0x67,
call_0xfffffffffffffed@@
mov_rdi_qword_ptr_[r13],
_0x25,
mov_ecx_3,
mov_dword_ptr_[rbp-0x1@@
mov_dword_ptr_[rbp-0x3@@
12+0x28],
2+1]_0x20,
]_xmm3,
and_r9d@@
call_0xffffffffffffe8@@
_eax_edx,
mov_qword_ptr_[rbp-0xa@@
_r8@@
jne_0x44,
movaps_xmmword_ptr_[r@@
mov_dword_ptr_[rbx@@
remove
12+4],
and_rsp_0xfffffffffffffff0,
call_0xfffffffffffffeb@@
mov_ecx_0x5@@
mov_rax_qword_ptr_[rbp-0x90],
cx+0x10],
hlt
mov_rbx_qword_ptr_[rsp+0x28],
call_0xfffffffffffffdd@@
cc],
mov_dword_ptr_[rbp+@@
mov_qword_ptr_[r13+0x1@@
93],
je_0x6c,
mov_esi_0x100,
cmp_eax_9,
mov_r13_r8,
+0x10],
mov_rdx_qword_ptr_[rax+0x20],
cmp_al_0x20,
lea_r12_[rsp+0x10],
push_rsp,
-1]@@
je_0x5e,
mov_byte_ptr_[rip+0x@@
mov_eax_dword_ptr_[rsp],
mov_dword_ptr_[rsp+0x18]@@
_xmm1_xmm0,
txn
8]_2,
add_eax_eax,
89],
9e],
mov_rdi_qword_ptr_[rbx+0x1@@
15+0x20],
lea_ecx_[rax@@
option
update
_0xfffffffd,
mov_esi_0x80,
movsxd_r13@@
test_al@@
14+0x18],
40]_1,
mov_r12d_0xffffffff,
_0x21,
mov_rax_qword_ptr_[rsp+0x50],
from
mov_rdi_qword_ptr_[r12+8],
jne_0xffffffffffffffdb,
mov_rax_qword_ptr_[rbx+0x120],
mov_qword_ptr_[rsp+0x68]_0,
call_0xffffffffffffad@@
jmp_0xffffffffffffd@@
40]_rax,
mov_ecx_r15d,
jne_0x51,
cmp_dword_ptr_[rsp+@@
mov_qword_ptr_[rsp+0x18]_rdx,
cmp_dword_ptr_[rbp-@@
mov_esi_dword_ptr_[rbx+0x@@
builtin
cmp_rdx_rcx,
mov_dword_ptr_[rsp+0x14]_0,
movzx_edi_word_ptr_[r@@
d_eax,
sub_dword_ptr_[rbp-0x@@
mov_qword_ptr_[rsp]_rdi,
mov_dword_ptr_[r12@@
call_0xffffffffffffbe@@
je_0x6e,
sub_rsp_0x98,
and_eax_4,
]_esi,
mov_dword_ptr_[rax@@
mov_eax_dword_ptr_[rax+0xc],
add_r12_1,
+rdx+0x@@
add_edx_eax,
lea_rax_[rsp+0x40],
lea_rdx_[rip+0x14@@
cmp_byte_ptr_[rbx+0x@@
cmp_eax_0x4@@
jmp_0xfffffffffffe@@
lea_rdi_[rip+0xc@@
movzx_eax_byte_ptr_[rsp+0x@@
sete_cl,
sub_rsp_0x80,
add_rsp_0x80,
2]_ax,
b8]_0,
call_0xffffffffffff90@@
err
size
je_0x76,
jne_0x5@@
di+0x158],
je_0x6b,
or_eax_1,
mov_ebx_ecx,
001,
9b],
cmovle@@
_byte_ptr_[rbx],
call_0xfffffffffffffee@@
mov_byte_ptr_[rbp+0x@@
mov_rdi_qword_ptr_[rdi+0x10],
imul_edx@@
mov_edi_0x42@@
di+0xc],
sub_edx_1,
218],
cmp_rax_rbx,
jne_0x3c,
jne_0xfffffffffffffea@@
mov_rdx_qword_ptr_[rdi+0x@@
call_0x1e@@
ax+0x48],
9f],
_rax@@
cmp_eax_0xffff86f4,
mov_edi_dword_ptr_[rip+0x20@@
81],
jne_0x7@@
lea_rbp_[rsp+0x10],
mov_dword_ptr_[rax+0x10]_1,
mov_word_ptr_[rbx+0x@@
-0x10],
mov_eax_0x7f2bb@@
add_rsp_0x88,
dx+4],
mov_esi_r15d,
cmp_rbp_rax,
lea_rsi_[rip+0xf@@
_qword_ptr_fs:[0x28],
lea_rsi_[rip+0x18@@
jmp_0x1a,
jmp_0xfffffffffffffc@@
add_rax_0x18,
jne_0x37,
2c]_0,
79],
968],
call_0xffffffffffffac@@
mov_edi_0x18,
mov_rdx_qword_ptr_[rbp-0x40],
mov_ecx_dword_ptr_[rax+4],
bx]@@
fc],
jne_0xffffffffffffffda,
mov_dword_ptr_[rbp-0x1c]_esi,
mov_eax_dword_ptr_[rbp-8],
jne_0xffffffffffffffe3,
mov_byte_ptr_[rbx@@
mov_dword_ptr_[rsp+0x10]@@
sub_edi@@
71],
mov_qword_ptr_[rbp-0x40]_rsi,
12+@@
and_eax_0x80808080,
call_0xffffffffffff8a@@
mov_dword_ptr_[rsp+0x8@@
call_0x2c@@
mov_ecx_dword_ptr_[rax+0x@@
mov_rax_qword_ptr_[rbp-0xe8],
f9],
jne_0x33,
add_rsi_1,
cmp_al_0xa,
cmp_r10d@@
mov_edx_dword_ptr_[rsp+8],
jne_0xffffffffffffffde,
lea_rdi_[rip-0x@@
mov_rbp_rbx,
add_rdx_rcx,
mov_eax_dword_ptr_[r14+0x@@
mov_ebp_ecx,
mov_edi_edx,
sub_r8d@@
_0x3ff,
_r15@@
bp-8],
sub_ebp@@
12]@@
je_0x68,
mov_rcx_qword_ptr_[rbx],
sub_rsp_0x60,
mov_r12d_edi,
110],
mov_rcx_qword_ptr_[rsp+0x20],
e8]_0,
je_0x70,
mov_dword_ptr_[rbp-@@
test_eax_0x8080,
8]_ebx,
mov_qword_ptr_[rbp-0x2@@
mov_rdi_qword_ptr_[rbp+0x10],
mov_rdx_qword_ptr_[rbp-0x48],
sub_ebx@@
8]_ebp,
mov_qword_ptr_[rsp+0x8@@
113@@
call_0xfffffffffffcd@@
mov_rax_qword_ptr_[rbp-0xa0],
call_qword_ptr_[rbp+0x@@
cmp_al_1,
entry
je_0x75,
mov_qword_ptr_[rax+0x20]_rdx,
7]_0,
mov_byte_ptr_[rdx+@@
add_rsp_0xa8,
jmp_0xffffffffffffff4@@
mov_ebx_0xffffffff,
call_0x16@@
movsxd_r14@@
5]_0,
test_ax_ax,
428],
movsxd_rcx_eax,
46],
call_0x17@@
mov_qword_ptr_[r14]_rax,
mov_byte_ptr_[rsp@@
f1],
lea_rdi_[rip+0x14@@
mov_rdi_qword_ptr_[rax+r@@
cmp_edi_1,
jne_0xffffffffffffffe0,
mov_r8d_ebx,
movabs_rcx@@
c0]_0,
mov_word_ptr_[rbp-0x@@
sub_qword_ptr_[rbp-0x@@
98]_0,
mov_ecx_0x3@@
si-0x@@
call_0x12@@
mov_eax_4,
mov_eax_dword_ptr_[rax+0x20],
mov_r13@@
recover
alloc
34]_0x20,
mov_r15_rcx,
or_qword_ptr_[r@@
add_rax_rsi,
_r13d@@
call_0xffffffffffff80@@
jne_0xffffffffffffffd8,
mov_qword_ptr_[r15+0x1@@
movzx_r9d_byte_ptr_[r@@
ja_0x7@@
mov_eax_0x60003,
ja_0xfffffffffffffe@@
lea_rsi_[rip+0x1a@@
62@@
_xmm1@@
call_0xffffffffffff8c@@
cmp_dword_ptr_[rax+0x@@
mov_esi_dword_ptr_[rbp-0x@@
je_0x73,
call_0xfffffffffffffe0@@
call_0xffffffffffff94@@
mov_eax_dword_ptr_[r13+0x@@
mov_dword_ptr_[rsi+@@
call_0xffffffffffffbf@@
cmp_edx_2,
jne_0x3a,
jne_0x41,
_sil,
jmp_0x24,
ax+0x50],
call_0xffffffffffff8b@@
jne_0x6@@
mov_dword_ptr_[rcx@@
movzx_eax_byte_ptr_[rdi],
sub_rcx_rax,
_0xfffffffc,
jne_0x40,
lea_eax_[rdx@@
lea_rsi_[rip+0x19@@
mov_eax_0x40,
mov_rsi_qword_ptr_[rsi],
call_0xffffffffffff87@@
call_0xffffffffffff96@@
lea_r13_[rsp+0x10],
_0x2a,
cmp_rcx_rax,
lea_rsi_[rip+0x17@@
mov_qword_ptr_[rsp+0x18]_rsi,
mov_qword_ptr_[rsp+0x10@@
cmp_rbx_r12,
je_0x77,
jne_0x3d,
f]_0,
mov_eax_dword_ptr_[rbx+8],
je_0x7e,
lea_rdx_[rip+0x4@@
cmp_ebp_1,
mov_r8d_ecx,
44]_0,
call_0xffffffffffeb@@
jmp_0xfffffffffffffff@@
mov_r8d_0xffffffff,
dm
mov_rsi_qword_ptr_[r13],
shl_edx@@
call_0xffffffffffff8d@@
9+r@@
dc],
add_ecx_1,
mov_qword_ptr_[rbp-0x20]@@
ham
mov_qword_ptr_[rbx+8]_0,
and_eax_0xffffff@@
cmp_dx@@
mov_edx_0x40,
_[rdx+1],
idiv@@
]_r12,
setne_dl,
call_0xffffffffffffab@@
6]@@
call_0xfffffffffff4@@
shl_rsi@@
cmp_qword_ptr_[rbx+0x1@@
je_0x74,
lea_rdi_[rip+0x8@@
cmp_edx_dword_ptr_[r@@
mov_dword_ptr_[rsp]_0,
mov_rbx_r8,
cmove_eax_edx,
mov_rsi_qword_ptr_[rsp+0x40],
4a],
mov_rcx_qword_ptr_[rax+8],
mov_edx_dword_ptr_[rax+0x18],
sub_rsi_rdi,
bx+0x1c],
test_al_8,
50]_rax,
je_0x78,
jne_0xffffffffffffffe1,
mov_dword_ptr_[rbp-0x14]_edi,
_0x88,
jne_0xffffffffffffffd6,
call_0xfffffffffffffcc@@
cmp_dword_ptr_[rbp-0x14]_0,
mov_r8_qword_ptr_[rsp],
shl_eax_8,
mov_dword_ptr_[r12]_eax,
call_0xfffffffffffce@@
mov_r9_r15,
_0x29,
mov_qword_ptr_[rbp-0xf@@
mov_rax_qword_ptr_[rax+r@@
mov_dword_ptr_[rbp-0x24]_eax,
mov_esi_0x1000,
mov_esi_0x40,
13+4],
_0x7fffffff,
_dil,
cmp_dword_ptr_[rip+0x20@@
a8]_0,
bp+0x28],
call_0x3e@@
pop_r8,
call_0xfffffffffffca@@
lea_rdx_[rbp-0x20],
mov_eax_dword_ptr_[rbp],
000000,
add_rsp_0x98,
mov_edi_0x@@
mov_rcx_r8,
*4],
lea_rcx_[rax+1],
_qword_ptr_[rsp+0x38],
lea_rax_[rbp-0x40],
mov_eax_0xffff8703,
cmp_al_0x2d,
jg_0x@@
cmp_dword_ptr_[rax+0x1@@
mov_eax_dword_ptr_[rsp+0x10],
not_ecx,
5a],
cmp_r12d_1,
ax+0xc],
mov_dword_ptr_[rsp+0x28]_eax,
mov_qword_ptr_[rbp-0xc@@
call_0xfffffffffffcb@@
jmp_0x1f,
mov_qword_ptr_[rax+r@@
and_r14d@@
e9],
add_rcx_rax,
jne_0x3f,
lea_ecx_[rdx@@
lea_rdi_[rip+0x13@@
test_bpl_bpl,
cvttsd2si@@
jmp_0x1e,
shl_ecx@@
0]_r9,
5e],
and_eax_8,
cmp_eax_7,
e1],
call_0xffffffffffff6c@@
68]_rax,
400],
lea_rcx_[rsp+8],
memp
52],
lea_ecx_[rax+1],
mov_rdi_qword_ptr_[rsp+0x48],
jne_0xffffffffffffffdc,
cmp_byte_ptr_[rbx+@@
_@@
call_0x2d@@
mov_rax_qword_ptr_[rax+0x48],
sub_rdi@@
jmp_0x22,
mov_dword_ptr_[r12+0x1@@
mov_r14_r8,
sar_edx@@
60]_rax,
mov_edx_edx,
mov_qword_ptr_[rsp+0x60]_rax,
]_xmm4,
test_byte_ptr_[rsp+0x@@
mov_rdx_qword_ptr_[rsp+0x40],
mov_rsi_qword_ptr_[rbx+0x10],
mov_rbp_qword_ptr_[rip+0x2@@
char
cmp_rcx_rdx,
cmp_rdi_rbx,
jne_0x48,
call_0x14@@
lea_r8d_[r@@
sub_r12@@
tree
82],
jne_0xffffffffffffffdf,
mov_rax_qword_ptr_[rax+0x50],
408],
deregister
mov_rsi_r9,
call_0x2b@@
ja_0x6@@
mov_r8d_0,
11+0x@@
3c]_0,
isc
78]_0,
_r9d@@
mov_dword_ptr_[rsp+0x28]@@
version
mov_rcx_qword_ptr_[rbp-0x10],
0]_r13,
di-0x@@
mov_esi_0x16,
8]_-1,
]_xmm5,
cmp_r14d_1,
14]_1,
lea_rdx_[rip+0x13@@
mov_edi_0x7@@
movdqa_xmm0_xmmword_ptr_[r@@
sbb_rax_rax,
call_0xffffffffffff98@@
45],
je_0x7d,
jne_0xffffffffffffffdd,
mov_qword_ptr_[rbp]_0,
+rcx*8],
18]@@
6]_0,
mov_byte_ptr_[rax+0x1@@
mov_rdx_qword_ptr_[rsp+0x@@
_0xfff@@
mov_qword_ptr_[rsp+0x10]_rdi,
8a],
10+r@@
_r10d@@
delete
ud2,
lea_rsi_[rsp+0x30],
mov_rcx_qword_ptr_[rax+0x@@
cx+4],
call_0xffffffffffff88@@
_qword_ptr_[rsp],
_r15d@@
mov_dword_ptr_[rax+0x10]_edx,
_0x108,
4]_4,
lea_rax_[rip+0x22@@
5d],
di+0x38],
mov_edx_dword_ptr_[rbp+0x10],
movzx_edx_dl,
bx*4],
cmp_dword_ptr_[rax@@
di+0xe0],
je_0x71,
seta@@
cx+rax],
mov_qword_ptr_[rbp+8]_rax,
57],
mov_r14d_esi,
add_r15_1,
add_rsp_0x4@@
_bpl,
je_0x7a,
output
_-0x80,
mov_qword_ptr_[rsp+0xa8]_rax,
not_eax,
jne_0xffffffffffffffd7,
mov_rcx_qword_ptr_fs:[0x28],
mov_esi_dword_ptr_[rip+0x@@
2]_al,
call_0x40@@
cmp_qword_ptr_[rbp-0x38]_0,
_0x10000,
_qword_ptr_[rsp+0x30],
mov_rdi_qword_ptr_[rdi+0x30],
search
add_rsi_qword_ptr_[r@@
mov_rcx_qword_ptr_[rbp-0x18],
a0]_0,
add_rsp_0x2@@
mov_r8d_edx,
gr
je_0x7c,
jne_0x45,
jne_0x46,
call_0xffffffffffffae@@
mov_ecx_dword_ptr_[rip+0x@@
mov_byte_ptr_[rsp+r@@
sub_ecx_eax,
114@@
4e],
call_0xfffffffffff9c@@
_esi@@
lea_rdx_[rsp+0x18],
jne_0xffffffffffffffd5,
mov_rax_qword_ptr_[rax+0x60],
call_0xffffffffffffe6@@
movzx_eax_byte_ptr_[rip+0x2@@
112@@
24]@@
mov_qword_ptr_[rcx]_rax,
movzx_ebp@@
4]_0xffffffff,
88]_0,
call_0x2e@@
mov_ecx_dword_ptr_[rdx],
mov_edx_6,
40]@@
+rax+@@
6a],
_0xfe,
_0x3e8,
cmp_rax_rsi,
je_0x6f,
mov_qword_ptr_[rax+0x18]_0,
mov_rcx_qword_ptr_[rbp+0x@@
mov_rdi_qword_ptr_[r15],
jmp_0xffffffffffffff3@@
jne_0x4d,
